[
  {
    "chunk_id": "0001",
    "text": "HIMACHAL PRADESH TECHNICAL UNIVERSITY HAMIRPUR Scheme and Syllabus for B.Tech CSE/CSE(AI&DS)/ CSE (AI&ML) (5th to 8th Semester) As Per National Education Policy (NEP-2020) (w.e.f. the Academic Year 2025-2026) Batches 2023 onwards",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 1
  },
  {
    "chunk_id": "0002",
    "text": "1 1. Preamble The role of higher education is very important in securing the gainful employment and/or providing further access to higher education comparable to the best available in the world class institutions elsewhere. The improvement in the quality of higher education, therefore, deserves to be given highest priority to enable the young generation of students to acquire skill, training and knowledge in order to enhance their thinking, comprehension and application abilities and prepare them to compete, succeed and excel globally. Sustained initiatives are required to reform the present higher education system for improving and upgrading the academic resources and learning environments by raising the quality of teaching and standards of achievements in learning outcomes in undergraduate programs. The Himachal Pradesh Technical University, Hamirpur (HPTU) upgraded its undergraduate programmes in CSE/CSE(AI&DS)/CSE(AI&ML) in accordance with NEP, 2020 which makes it student-centric, interactive and outcome-oriented with well-defined aims, objectives and goals to achieve. NEP, 2020 aims at making higher education multidisciplinary learning process. In other words, the curriculum will be flexible, it will allow students to take up creative subject- combinations. 2. Nature of Bachelor’s Degree Programme in CSE/CSE(AI&DS)/CSE(AI&ML) The curriculum of Bachelor’s Degree in CSE/CSE(AI&DS)/CSE(AI&ML) is divided into 4 stages with multiple exit-entry as per NEP 2020. The type of award, stage of exit and the mandatory credits to be achieved by the student at the time of exit is described in the table below. S. No. Type of Award Stage of Exit Mandatory Credits to be Secured for the Award of Degree at Exit 1. UG Certificate in CSE For those who exit after the first year (two semesters) of the undergraduate programme. (Programme Duration: first year or two semesters of the undergraduate programme). 47 2. UG Diploma in CSE For those who exit after two years (four semesters) of",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 2
  },
  {
    "chunk_id": "0003",
    "text": "the undergraduate programme. (Programme Duration: first-two years or four semesters of the undergraduate programme). 101 (95+6 credit) 3. B. Sc. in CSE For those who exit after three years (six semesters) of the undergraduate programme. (Programme Duration: first-three years or six semesters of the undergraduate programme). 142 (136 + 6 credit)",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 2
  },
  {
    "chunk_id": "0004",
    "text": "2 4. Bachelor of Technology in CSE/CSE(AI&DS)/ CSE(AI&ML) For those who exit after four years (eight semesters) of the undergraduate programme. (Programme Duration: first-four years or eight semesters of the undergraduate programme). 170 *Note: 1. Those students who wish to leave the studies after completion of 2nd year, can exercise exit option at the time of registration of 4th semester, for award of UG Diploma, provided they secure an additional 6 credits through summer internship of 8 weeks/ 2 months duration during summer term or summer vacations after the end of 4th semester. 2. Those students who wish to leave the studies after completion of 3rd year, can exercise exit option at the time of registration for 6th semester, for award of B.Sc. in CSE, provided they secure an additional 6 credits through summer internship of 8 weeks/ 2 months duration during summer term or summer vacations after end of 6th semester. 3. Internship-I & II (course of 6 credits) after IV & VI Semester of 8 weeks/ 2 months duration will be COMPULSORY for those who desire to leave the programme with UG Diploma & B.Sc. Degree. The evaluation of such candidates (who opted for UG Diploma & B.Sc. Degree) shall be done within the first- two months of the running next semester i.e. 5th & 7th sem. The internship shall be focused on site EXPERIENTIAL LEARNING and CONTRIBUTION TO COMMUNITY, and completed by student during summer vacations under supervision of faculty of department for benefit of local industry, government/private organization, entrepreneurs, craft and skilled people. 3. Awarding of UG Diploma, and Degrees: a) UG Diploma: Students who opt to exit after completion of the second year and have earned a minimum of 102 credits will be awarded the UG diploma, if in addition, they complete work based vocational",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 3
  },
  {
    "chunk_id": "0005",
    "text": "course/internship of 6 credits during the summer vacation of the second year. It is to be noted that students admitted through lateral entry scheme (diploma level entry in 3rd semester) cannot exercise exit option in the 4th semester for UG diploma, as it is exclusively for students admitted in first semester (regular) only. b) 3-year UG Degree: Students who opt to exit after completion of the third year and have earned a minimum of 141 credits will be awarded the B.Sc. in CSE /CSE (AI&DS)/CSE (AI&ML), if in addition, they complete work based vocational course/internship of 6 credits during the summer vacation of the third year. c) 4-year UG Degree (Honours): Those who want to pursue B. Tech. (HONOURS) as enshrined in NEP 2020 Guidelines, they will have to maintain CGPA of 8.0 without any backlogs during their degree, earning a minimum of 170 credits.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 3
  },
  {
    "chunk_id": "0006",
    "text": "3 d) 4-year UG Degree: All else who fails to maintain the mandatory requirements for HONOURS degree will be awarded with B.Tech CSE/CSE(AI&DS)/CSE(AI&ML) degree. e) 4-year UG Degree (B.Tech Honours with Research): Students who secure a minimum of 8.0 CGPA in the first-six semesters and are pursuing HONOURS in particular stream and wish to undertake research at the undergraduate level can choose a research stream in the fourth year. They should do a research project under the guidance of a faculty member of the college. The research project will be in the major discipline. The students who secure a minimum of 170 credits, minimum 18 credits from Honors course and 12 credits from a research project, will be awarded UG Degree (B.Tech. Honors with Research). f) Re-entry to Complete the Program: A student exiting with a UG Diploma or B.Sc. should be entitled to re-enroll in the programme of the same engineering discipline. Only students admitted to the B.Tech. programme and exercised an exit option are eligible for re-admission to the B.Tech. programme under the same discipline. It is suggested that all credits will be transferred, if the student enrolls back within a limited period (3 years) of exiting. In case a student enrolls after that, then the decision on the transfer of credits should be based on the changes in the curriculum the student studied. A candidate after exit may rejoin the course only at the commencement of the semester at which he/she discontinued, provided he/she pays the prescribed fees. The total period of completion of the B.Tech. course reckoned from the commencement of the first semester to which the candidate was admitted shall not in any case exceed 7 years, including of the period of discontinuance. g) Completion Possibility in Other Institutions: A student can earn a UG",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 4
  },
  {
    "chunk_id": "0007",
    "text": "Diploma/B.Sc. in one institution (Engineering) and complete the degree program in another institution (same Engineering discipline only within HPTU). 4. Programme Structure A. Definition of Credit: 1 Hour Lecture (L) Per Week 1 Credit 2 Hour Tutorial (T) Per Week 1 Credit 2 Hours Practical (P) Per Week 1 Credit B. Range of Credits: In the light of the fact that as per NEP 2020, the minimum credit for Four-year Under Graduate degree program in Engineering is 160 credits, the total number of credits for the four-year B. Tech/B.E. in CSE /CSE (AI&DS)/CSE (AI&ML) is 170. C. Structure of UG Program: The structure of UG program in CSE shall have essentially the following categories of courses with the breakup of credits as given:",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 4
  },
  {
    "chunk_id": "0008",
    "text": "4 S. No. Category Breakup of Credits 1. Humanities & Social Science Courses 18 2. Basic Science Courses 22 3. Engineering Science Courses 18 4. Program Core Courses (Branch specific) 65 5. Professional Elective Courses (Branch specific) 16 6. Open Elective/Multidisciplinary Courses 10 7. Project work, Seminar and Internship in Industry or elsewhere 21 TOTAL 170 HUMANITIES & SOCIAL SCIENCES COURSES [HS] (i) Number of Humanities & Social Science Courses: 7 (ii) Credits: 18 S. No Code No. Course Title Semester Hours per week Total Credits Lecture Tutorial Practical 1 HS-111 (P) Communication Skills I 3 0 2 4 2 EVS-111 Energy and Environment I 2 1 0 3 3 UHV-111 Universal Human Values and Awareness About Himachal Pradesh II 3 0 0 3 4 HS-122P Holistic Health & Yoga II 0 0 2 1 5 IKS-311 Indian Knowledge System III 2 0 0 2 6 HS-311 Engineering Economics and Management III 2 0 0 2 7 HS-611 Start-Up, Innovation and Entrepreneurship VI 3 0 0 3 Total Credits 18 *******",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 5
  },
  {
    "chunk_id": "0009",
    "text": "5 BASIC SCIENCE COURSES [BS] (i) Number of Basic Sciences Courses: 5 (ii) Credits: 22 S. No Code No. Course Title Semester Hours per week Total Credits Lecture Tutorial Practical 1 PHY-111 (P) Applied Physics I 3 1 2 5 2 MA-111(A) Applied Mathematics-I I 3 1 0 4 3 CHM-111 (P) Applied Chemistry II 3 1 2 5 4 MA-121(A) Applied Mathematics-II II 3 1 0 4 5 MAFE-311 Probability Theory and Statistics III 3 1 0 4 Total Credits 22 ******* ENGINEERING SCIENCE COURSES [ES] (i) Number of Engineering Sciences Courses: 5 (ii) Credits: 18 S. No Code No. Course Title Semester Hours per week Total Credits Lecture Tutorial Practical 1 EE-111 (P) Basic Electrical Engineering I 3 1 2 5 2 WXX-111 Workshop I 0 0 4 2 3 CS-111 (P) Computer Programming II 3 0 2 4 4 EC-111 (P) Basic Electronics Engineering II 3 1 2 5 5 ME-111P Engineering Graphics and Design II 0 0 4 2 Total Credits 18 *******",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 6
  },
  {
    "chunk_id": "0010",
    "text": "6 PROGRAM CORE COURSES [PC] (i) Number of Program Core Courses: 15 (ii) Credits: 65 S. No. Course Code Course Title L T P Semester Credits 1 CSPC-311 Data Structure and Algorithms 3 1 2 III 5 2 CSPC-312 Python Programming 2 0 2 III 3 3 CSPC-313 Computer Organization & Architecture 3 1 0 III 4 4 CSPC-411 Discrete Mathematics 3 0 0 IV 3 5 CSPC-412 Operating System 3 1 0 IV 4 6 CSPC-413 Design and Analysis of Algorithm 3 1 2 IV 5 7 CSPC-414 AI in Engineering 3 0 2 IV 4 8 CSPC-415 DBMS 3 1 2 IV 5 9 CSPC-511 Computer Network 3 1 2 V 5 10 CSPC-512 Theory of Computation 3 1 0 V 4 11 CSPC-513 Machine Learning 3 1 2 V 5 12 CSPC-514 Software Engineering 3 1 0 V 4 13 CSPC-514 Data Warehousing and Data Mining 3 1 0 V 4 14 CSPC-611 Cloud Computing 3 1 2 VI 5 15 CSPC-612 Compiler Design 3 1 2 VI 5 Total Credits 65 ******",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 7
  },
  {
    "chunk_id": "0011",
    "text": "7 PROFESSIONAL ELECTIVE COURSES [PE] (i) Number of Professional Elective Courses: 4 (ii) Credits: 16 S. No. Course Code* Course Title L T P Semester Credits 1 CSPE-613X Professional Elective – I 3 1 0 VI 4 2 CSPE-711X Professional Elective – II 3 1 0 VII 4 3 CSPE-712X Professional Elective – III 3 1 0 VII 4 4 CSPE-713X Professional Elective - IV 3 1 0 VII 4 Total Credits 16 *The Course codes for the elective courses shall be the course code for the elective taken by the student. ******* OPEN ELECTIVE/MULTI-DISCIPLINARY COURSES (i) Number of Courses: 03 (ii) Credits: 10 S. No. Course Code$ Course Title L T P Semester Year Credits 1 ECEPC-312 Digital System Design 3 0 2 III 2nd 4 2 ECEPC-412 Microcontroller 3 0 0 IV 2nd 3 3 XXNNN Open Elective - I 3 0 0 VII 4th 3 Total Credits 10 PROJECT WORK, SEMINAR AND INTERNSHIP IN INDUSTRY OR ELSEWHERE [EE] (i) Number of EE Courses: 5 (ii) Credits: 20",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 8
  },
  {
    "chunk_id": "0012",
    "text": "8 S. No. Course Code Course Title L T P Semester Credits 1 CSEE-711P Seminar 0 0 2 VI 1 2 CSEE-712P Major Project-1 0 0 4 VII 2 3 CSEE-713P Internship Presentation /Viva Voice) 0 0 0 VII 4 4 CSEE-811P Major Project -II 0 0 24 VII 12 5 CSEE-812P Industrial Project/Internship 0 0 24 VIII 12 Total Credits 21 5. SCHEME OF EXAMINATION The pass percentage in each subject will be 40%.  Theory Examination Irrespective of credits, each paper will be of 100 marks (60 marks for end semester examination and 40 marks for internal assessment) and duration of end semester examination paper will be 3 hours.  Practical Examination Evaluation will be of 50 marks (20 marks for external practical examination and 30 marks for internal assessment).  Project Report (Engineering Project Labs/Major Projects/Internships) / Dissertation The Project / Dissertation will be evaluated by the internal panel approved by Director-cum-Principal of the institute and external examiner from the panel approved by the university authority/evaluation branch, HPTU Hamirpur. The Head of the Department will assign a guide/supervisor, to each candidate for his/her project/dissertation work. The candidate shall be required to maintain his/her project diary (log book) of work in the organization or under the guide/supervisor. Each student will be required to give at least two seminars/presentations on his/her project work/dissertation work. Each student is required to submit three copies of his/her project reports in the Department after completion of the project work which will be evaluated by external examiner. Most of the students are expected to work on a real-time project/research preferably in some industry/research and development laboratories/educational institution. The student can formulate a project problem/research problem with the help of his/her guide/supervisor and submit the project proposal/research proposal of the same in the college within",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 9
  },
  {
    "chunk_id": "0013",
    "text": "10 days at the starting of project work. Approval of the project proposal is mandatory which will be evaluated by panel of internal examiner(s) appointed by respective head of the institute. If approved, the student can commence working on it and complete it within the provided time frame.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 9
  },
  {
    "chunk_id": "0014",
    "text": "9 6. SUBJECT CODE SYSTEM Each subject code is denoted by alpha-numerals, alphabets before hyphen indicates course name and category of the subject, and numerals after hyphen indicates semester and subject number. (i) For Example: CSPC-311  First two alphabets \"CS\"is branch indicator.  Second two alphabets \"PC\" is programme core, i.e. category of the subject.  After hyphen: Digit \"3\" defines the semester and \"11\" defines the serial number of the subject in the scheme. (ii) For Example: CSPC-411P  First two alphabets \"CS\" is branch indicator.  Second two alphabets \"PC\" is programme core, i.e. category of the subject.  After hyphen: Digit \"4\" defines the semester, \"11\" defines the serial number of the subject in the scheme, and last alphabet \"P\" indicates that it is practical course. 7. HONOURS DEGREE GUIDELINES 1. Students those who want to pursue B. Tech. HONOURS as enshrined in NEP 2020 Guidelines, they will have to maintain CGPA of 8.0 without any backlogs during their degree. 2. Students who wish to pursue B.Tech. degree with Honours specialization, are required to earn additional minimum 18credits starting from 5th semester. 3. Starting from 5th semester onwards, Department(s) may offer Honours Degree Courses from approved additional courses (not part of mandatory/available credits for regular degree completion). Depending upon availability of faculty and infrastructure in particular institute, the electives can also be opted from Swayam/Online Approved AICTE or UGC Course Portal and students should produce Grade Certificate on successful completion of the course but the content should match with the courses offered under the curriculum. 4. If student fails in any course registered for title of Honours Degree, only one opportunity shall be given to student to re-appear and improve his/her CGPA so as to maintain 8.0 CGPA. Student registration shall be considered null and void",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 10
  },
  {
    "chunk_id": "0015",
    "text": "for Honours Degree title, in case he/she fails in 2nd attempt in such subject of Honours Degree programme- whenever the results are declared. This will have no impact on his/her obtaining the Major Degree or Degree in parent department in which he/she is originally registered. 5. If student fails in more than one subject of Courses in Honours Degree after registering for Honours Degree, his/her registration shall be considered to have been withdrawn and he/she shall not be awarded Honours Degree title.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 10
  },
  {
    "chunk_id": "0016",
    "text": "10 6. Details about the courses completed and credits earned for Honours Degree will appear only in \"8th Semester Grade Sheet\" and \"Consolidated Grade Sheet\". These details will be listed under the heading \"Credits Earned for Honours Degree\". In the case of student who have either withdrawn from Honours Degree or become ineligible for Honours Degree, the credits earned for the courses registered and successfully completed for Honours Degree will be listed under the heading \"Additional Credits Earned\". However, such additional earned credits will not be counted in credits to be earned for Major Degree. 7. No student will be allowed to register for both Honours Degree and Minor Degree simultaneously. 8. MINOR DEGREE GUIDELINES 1. Students of other departments/programmes those who want to pursue B. Tech. with MINOR degree as enshrined in NEP 2020 Guidelines, they will have to maintain CGPA of 8.0 without any backlogs during their degree. 2. Students who wish to pursue B.Tech. degree with Minor specialization, are required to earn additional minimum 18 credits starting from 5th semester. 3. Starting from 5th semester onwards, Department(s) may offer Minor Degree Courses. Depending upon availability of faculty and infrastructure in particular institute, the courses can also be opted from Swayam/Online Approved AICTE or UGC Course Portal and students should produce Grade Certificate on successful completion of the course but the content should match with the courses offered under the curriculum. 4. If student fails in any course registered for title of Minor Degree, only one opportunity shall be given to student to re-appear and improve his/her CGPA so as to maintain 8.0 CGPA. Student registration shall be considered null and void for Minor Degree title, in case he/she fails in 2nd attempt in such subject of Minor Degree programme- whenever the results are declared. This will have",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 11
  },
  {
    "chunk_id": "0017",
    "text": "no impact on his/her obtaining the Major Degree or Degree in parent department in which he/she is originally registered. 5. If student fails in more than one subject of Courses in Minor Degree after registering for Minor Degree, his/her registration for Minor Degree shall be considered to have been withdrawn and he/she shall not be awarded Minor Degree title. 6. Details about the courses completed and credits earned for Minor Degree will appear only in \"8th Semester Grade Sheet\" and \"Consolidated Grade Sheet\". These details will be listed under the heading \"Credits Earned for Minor Degree\". In the case of student who have either withdrawn from Minor Degree or become ineligible for Minor Degree, the credits earned for the courses registered and successfully completed for Minor Degree will be listed under the heading \"Additional Credits Earned\". However, such additional earned credits will not be counted in credits to be earned for Major Degree. 7. No student will be allowed to register for both Minor Degree and Honours Degree simultaneously.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 11
  },
  {
    "chunk_id": "0018",
    "text": "11 CREDIT DISTRIBUTION SEMESTER WISE 5th to 8th Sem",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 12
  },
  {
    "chunk_id": "0019",
    "text": "12 Semester-V S. No. Category Subject Code Subject Title L T P/D Credits Evaluation Scheme (Marks) Internal Assessment (IA) ESE Subject Total Theory: 1 PC CSPC-511 Computer Networks 3 1 0 4 40 60 100 2 PC CSPC-512 Theory of Computation 3 1 0 4 40 60 100 3 PC CSPC-513 Introduction to Machine Learning 3 1 0 4 40 60 100 4 PC CSPC-514 Software Engineering 3 1 0 4 40 60 100 5 PC CSPC-515 Data Warehousing and Data Mining 3 1 0 4 40 60 100 Labs: 1 PC CSPC-511P Computer Networks Lab 0 0 2 1 30 20 50 2 PC CSPC-513P Machine Learning Lab 0 0 2 1 30 20 50 Total 15 05 04 22 600 Honors/Minor Degree Courses (Optional Additional Courses) 1 HD/MD XXHD-5XX /XXMD-5XX Course-I 3 1 0 4 40 60 100 2 HD/MD XXHD-5XX /XXMD-5XX Course-II 3 1 0 4 40 60 100 Note:- Those who want to pursue B.Tech. (MINOR) as enshrined in NEP 2020 Guidelines, they will have to maintain CGPA of 8.0 without any backlogs during their degree. The students admitted in the third year will be given a chance to opt for Minor degree. Eligibility to avail this option is CGPA of 8.0 and above with no arrears till the completion of second year. The student has to earn 18 credits by registering the prescribed courses offered up to the eighth semester. A student can exercise the option to withdraw from the Minor degree at any time after entry. Details about the courses completed and credits earned for Minor degree will appear only in the ‘Eighth Semester Grade Sheet’ and ‘Consolidated Grade Sheet’. These details will be listed under the heading ‘Credits Earned for Minor degree’. In the case of students who have either withdrawn from Minor",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 13
  },
  {
    "chunk_id": "0020",
    "text": "degree or become ineligible Minor degree by not fulfilling minimum requirements, the credits earned for the courses registered and successfully completed for Minor degree will be listed under the heading ‘Additional Credits Earned’. The CGPA will be calculated for all the courses credited by the students’ inclusive regular courses and Minor courses. A student enrolled on any of Minor discipline has to undergo subjects in same domain as chosen initially and concerned department (in case of minor) has to offer the domain from existing areas in which courses are to be taught for each batch without deviation from selected domains.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 13
  },
  {
    "chunk_id": "0021",
    "text": "13 Semester-VI S. No. Category Subject Code Subject Title L T P/D Credits Evaluation Scheme (Marks) Internal Assessment (IA) ESE Subject Total Theory: 1 PC CSPC-611 Cloud Computing 3 1 0 4 40 60 100 2 PC CSPC-612 Compiler Design 3 1 0 4 40 60 100 3 PE CSPE-613X Professional Elective -I 3 1 0 4 40 60 100 4 HS HS-611 Start-Up, Innovation and Entrepreneurship 3 0 0 3 40 60 100 Labs: 1 PC CSPC-611P Cloud Computing Lab 0 0 2 1 30 20 50 2 PC CSPC-612P Compiler Design Lab 0 0 2 1 30 20 50 3 EE CSEE-613P Capstone Project 0 0 4 2 60 40 100 Total 15 03 08 19 600 Honors/Minor Degree Courses (Optional Additional Courses) 1 HD/MD XXHD-6XX /XXMD-6XX Course-III 3 0 0 3 40 60 100 2 HD/MD XXHD-6XX /XXMD-6XX Course-IV 3 1 0 4 40 60 100 B.Sc. Degree Exit Option 1 INT CS-614P Internship-II 8weeks/2months 6 50 50 100 Note:- All Programme Electives (PE-I,PE-II, PE-III and PE-IV ) are required to be completed by all students. Those students who wish to leave the studies after completion/end of 3rd year, can exercise exit option for B.Sc. Degree in Computer Science and Engineering during registration for 6th semester. They will be required to obtain additional 6 credits summer internship (Internship-II (Exit)) of 8-weeks/2-months duration during summer term/summer vacations after 6th semester. The evaluation of such candidates shall be done within the first-two months of the running next semester i.e. 7th sem. The internship shall be completed by student during summer vacations after 6th semester, in local industry, government/private organization, entrepreneurs, craft and skilled persons for on-site experiential learning. Students who have not exercised exit option, shall be required to pursue “Internship” of 6 weeks duration (4-credits course) during summer",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 14
  },
  {
    "chunk_id": "0022",
    "text": "vacations after end of exams of 6th semester. The evaluation or viva-voce of this course will be done with end semester practical exams of 7th sem. Those who want to pursue B.Tech. (MINOR) as enshrined in NEP 2020 Guidelines, they will have to maintain CGPA of 8.0 without any backlogs during their degree. The students admitted in the third year will be given a chance to opt for Minor degree. Eligibility to avail this option is CGPA of 8.0 and above with no arrears till the completion of second year. The student has to earn 18 credits by registering the prescribed courses offered up to the eighth semester. A student can exercise the option to withdraw from the Minor degree at any time after entry. Details about the courses completed and credits earned for Minor degree will appear only in the ‘Eighth Semester Grade Sheet’ and ‘Consolidated Grade Sheet’. These details will be listed under the heading ‘Credits Earned for Minor degree’. In the case of students who have either withdrawn from Minor degree or become ineligible for Minor degree by not fulfilling minimum requirements, the credits earned for the courses registered and successfully completed for Minor degree will be listed under the heading ‘Additional Credits Earned’. The CGPA will be calculated for all the courses credited by the students’ inclusive regular courses and Minor courses. A student enrolled on any of Minor discipline has to undergo subjects in same domain as chosen initially and concerned department (in case of minor) has to offer the domain from existing areas in which courses are to be taught for each batch without deviation from selected domains. Those who want to pursue B.Tech. (MINOR) as enshrined in NEP 2020 Guidelines, they will have to maintain CGPA of 8.0 without any backlogs during their",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 14
  },
  {
    "chunk_id": "0023",
    "text": "degree. Total Credits earned by the student opting B.Sc. Degree Exit Option exit after 6th Semester is 95 (1st and 2nd year) +41 (3rd year) + 6=142 credits",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 14
  },
  {
    "chunk_id": "0024",
    "text": "14 Semester-VII S. No. Category Subject Code Subject Title L T P/D Credits Evaluation Scheme (Marks) Internal Assessment (IA) ESE Subject Total Theory: 1 OE XXOE-711X Open Elective-I 3 0 0 3 40 60 100 2 PE CSPE-711X Professional Elective -II 3 1 0 4 40 60 100 3 PE CSPE-712X Professional Elective -III 3 1 0 4 40 60 100 4 PE CSPE-713X Professional Elective -IV 3 1 0 4 40 60 100 Labs: 1 EE CSEE-711P Seminar 0 0 2 1 50 50 100 2 EE CSEE-712P Major Project-1 0 0 4 2 60 40 100 3 EE CSEE-713P Internship Presentation /Viva Voice) 0 0 0 4 60 40 100 Total 12 03 06 22 600 Honors/Minor Degree Courses (Optional Additional Courses) 1 HD/MD XXHD-7XX/ XXMD-7XX Course-V 3 0 0 3 40 60 100 Note:- All Programme Electives (PE-I, PE-II , PE-III and PE-IV) are required to be completed by all students. One Open Electives (OE-I) is required to be completed by all students from discipline other than parent branch. Major Project-I to be evaluated by departmental review committee Those who want to pursue B.Tech. (MINOR) as enshrined in NEP 2020 Guidelines, they will have to maintain CGPA of 8.0 without any backlogs during their degree. The students admitted in the third year will be given a chance to opt for Minor degree. Eligibility to avail this option is CGPA of 8.0 and above with no arrears till the completion of second year. The student has to earn 18 credits by registering the prescribed courses offered up to the eighth semester. A student can exercise the option to withdraw from the Minor degree at any time after entry. Details about the courses completed and credits earned for Minor degree will appear only in the ‘Eighth Semester Grade Sheet’",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 15
  },
  {
    "chunk_id": "0025",
    "text": "and ‘Consolidated Grade Sheet’. These details will be listed under the heading ‘Credits Earned for Minor degree’. In the case of students who have either withdrawn from Minor degree or become ineligible for Minor degree by not fulfilling minimum requirements, the credits earned for the courses registered and successfully completed for Minor degree will be listed under the heading ‘Additional Credits Earned’. The CGPA will be calculated for all the courses credited by the students’ inclusive regular courses and Minor courses. A student enrolled on any of Minor discipline has to undergo subjects in same domain as chosen initially and concerned department (in case of minor) has to offer the domain from existing areas in which courses are to be taught for each batch without deviation from selected domains.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 15
  },
  {
    "chunk_id": "0026",
    "text": "15 Semester-VIII S. No. Category Subject Code Subject Title L T P/D Credits Evaluation Scheme (Marks) Internal Assessment (IA) ESE ubject Total Theory: 1 EE CSEE-811P Major Project -II 0 0 24 12 60 40 100 OR 2 EE CSEE-812P Industrial Project/Internship 0 0 24 12 60 40 100 OR (FOR B. Tech. (HONOURS WITH RESEARCH)) 3 RS CSRS-813P Research Project 0 0 24 12 60 40 100 Total 0 0 24 12 100 Note:- Major Project-II / Research Project shall be evaluated by departmental review committee and research publication is desirable The teaching load of Major Project-II /Research Project may be counted as up to maximum 4 hours in a week for any faculty within minimum teaching load (as prescribed by AICTE from time to time), and may be extended up to 8 hours beyond minimum teaching load in which the student shall report to the allocated faculty.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 16
  },
  {
    "chunk_id": "0027",
    "text": "16 List of Programme Electives Programme Elective-I Sr. No. Category Subject Code Subject Title L T P/D Credits Stream/ Specialization 1. PE CSPE-613-A Digital Image Processing 3 1 0 4 CSE/ CSE(AIDS)/ CSE(AIML) 2. PE CSPE-613-B Distributed Operating Systems 3 1 0 4 3. PE CSPE-613-C Advanced Computer Networks 3 1 0 4 4. PE CSPE-613-D */**Deep Learning 3 1 0 4 5. PE CSPE-613-E Augmented and Virtual Reality 3 1 0 4 6. PE CSPE-613-F **Responsible and Ethical Artificial Intelligence 3 1 0 4 7. PE CSPE-613-G **Bayesian Learning & Decision Making 3 1 0 4 *8. PE CSPE-613-H SWAYAM/ Online (Approved) Course 4 * Compulsory for B.Tech CSE (AI&DS) & ** compulsory B.Tech CSE (AI&ML) Note-Candidates will be allowed to pursue course only from SWAYAM portal or such portals, which are approved by UGC/AICTE or university The permission to enroll for such courses shall be granted only by respective departments within the affiliated institutes. The student can exercise option from 12-week courses available on SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL portal after due approval from the parent department of respective college of which intimation should be done to the University at the time of registration. The following points must be taken care of: a) Student registration for the above courses shall be only through the institution; it is mandatory to share necessary information with the University. b) While opting the courses listed above, the institution would essentially avoid the courses offered or already studied as part of the curriculum as it may otherwise lead to duplication and repetition of the same course. c) The institution shall designate a faculty member as a Mentor for each course to guide the students from registration till com pletion of the credit course. Student pursuing course through SWAYAM/ONLINE APPROVED AICTE OR UGC",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 17
  },
  {
    "chunk_id": "0028",
    "text": "COURSE/NPTEL shall acquire the required credits only after successful completion of the course and submitting a certificate issued by the competent authority. Programme Elective-II Sr. No. Category Subject Code Subject Title L T P/D Credits Stream/ Specialization 1. PE CSPE -711-A */**Data Science 3 1 0 4 CSE/ CSE(AIDS)/ CSE(AIML) 2. PE CSPE -711-B Image Processing and Computer Vision 3 1 0 4 3. PE CSPE -711-C Advanced Computer Architecture 3 1 0 4 4. PE CSPE -711-D Mobile Computing and Wireless Networks 3 1 0 4 5. PE CSPE -711-E **Natural Language Processing 3 1 0 4 6. PE CSPE -711-F **Internet of Things 3 1 0 4 *7. PE CSPE -711-G SWAYAM/ Online (Approved) Course 4",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 17
  },
  {
    "chunk_id": "0029",
    "text": "17 * Compulsory for B.Tech CSE (AI&DS) ** Compulsory for B.Tech CSE (AI&ML) Note-Candidates will be allowed to pursue course only from SWAYAM portal or such portals, which are approved by UGC/AICTE or university. The permission to enroll for such courses shall be granted only by respective departments within the affiliated institutes. The student can exercise option from 12-week courses available on SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL portal after due approval from the parent department of respective college of which intimation should be done to the University at the time of registration. The following points must be taken care of: Student registration for the above courses shall be only through the institution; it is mandatory to share necessary information with the University. While opting the courses listed above, the institution would essentially avoid the courses offered or already studied as part of the curriculum as it may otherwise lead to duplication and repetition of the same course. c) The institution shall designate a faculty member as a Mentor for each course to guide the students from registration till completion of the credit course. Student pursuing course through SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL shall acquire the required credits only after successful completion of the course and submitting a certificate issued by the competent authority. Programme Elective-III Sr. No. Category Subject Code Subject Title L T P/D Credits Stream/ Specialization 1. PE CSPE -712-A */**Data Visualization 3 1 0 4 CSE/ CSE(AIDS)/ CSE(AIML) 2. PE CSPE -712-B **Optimization Techniques in ML 3 1 0 4 3. PE CSPE -712-C Full Stack Development with AI 3 1 0 4 4. PE CSPE -712-D **Quantum Computing 3 1 0 4 5. PE CSPE -712-E UNIX/Linux Operating Systems 3 1 0 4 6. PE CSPE -712-F AdHoc and Wireless Sensor Networks 3 1",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 18
  },
  {
    "chunk_id": "0030",
    "text": "0 4 *7. PE CSPE -712-G SWAYAM/ Online (Approved) Course 4 * Compulsory for B.Tech CSE (AI&DS) ** Compulsory for B.Tech CSE (AI&ML) Note- Candidates will be allowed to pursue course only from SWAYAM portal or such portals, which are approved by UGC/AICTE or university. The permission to enroll for such courses shall be granted only by respective departments within the affiliated institutes. The student can exercise option from 12-week courses available on SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL portal after due approval from the parent department of respective college of which intimation should be done to the University at the time of registration. The following points must be taken care of: a) Student registration for the above courses shall be only through the institution; it is mandatory to share necessary information with the University. b) While opting the courses listed above, the institution would essentially avoid the courses offered or already studied as part of the curriculum as it may otherwise lead to duplication and repetition of the same course. c) The institution shall designate a faculty member as a Mentor for each course to guide the students from registration till com pletion of the credit course. Student pursuing course through SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL shall acquire the required credits only after successful completion of the course and submitting a certificate issued by the competent authority. Programme Elective-IV Sr. No. Category Subject Code Subject Title L T P/D Credits Stream/ Specialization 1. PE CSPE -713-A */**Big Data 3 1 0 4 CSE/ CSE(AIDS)/ CSE(AIML) 2. PE CSPE -713-B **Advanced Machine Learning 3 1 0 4 3. PE CSPE -713-C Blockchain Technology 3 1 0 4 4. PE CSPE -713-D Devops 3 1 0 4 5. PE CSPE -713-E Cyber Forensic 3 1 0 4 6. PE CSPE",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 18
  },
  {
    "chunk_id": "0031",
    "text": "-713-F Soft Computing 3 1 0 4 7. PE CSPE -713-G **Generative AI 3 1 0 4 *8. PE CSPE -713-H SWAYAM/ Online (Approved) Course 4",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 18
  },
  {
    "chunk_id": "0032",
    "text": "18 * Compulsory for B.Tech CSE (AI&DS) ** Compulsory for B.Tech CSE (AI&ML) Note-Candidates will be allowed to pursue course only from SWAYAM portal or such portals, which are approved by UGC/AICTE or university. The permission to enroll for such courses shall be granted only by respective departments within the affiliated institutes. The student can exercise option from 12-week courses available on SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL portal after due approval from the parent department of respective college of which intimation should be done to the University at the time of registration. The following points must be taken care of: a) Student registration for the above courses shall be only through the institution; it is mandatory to share necessary information with the University. b) While opting the courses listed above, the institution would essentially avoid the courses offered or already studied as part of the curriculum as it may otherwise lead to duplication and repetition of the same course. c) The institution shall designate a faculty member as a Mentor for each course to guide the students from registration till com pletion of the credit course. Student pursuing course through SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL shall acquire the required credits only after successful completion of the course and submitting a certificate issued by the competent authority.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 19
  },
  {
    "chunk_id": "0033",
    "text": "19 Open Elective-I (for other departments) S. No. Category Subject code Subject Title TeachingHours Per Week Credits Stream /Specialization L T P/D 1 OE CSOE-711-A Data Structure and Algorithms (Syllabus as per CSPC-311) 3 0 0 3 CSE/ CSE(AIDS)/ CSE(AIML) 2 OE CSOE-711-B Python Programming (Syllabus as per CSPC-312) 3 0 0 3 3 OE CSOE-711-C Computer Organization and Architecture (Syllabus as per CSPC-313) 3 0 0 3 4 OE CSOE-711-D Computer Networks (Syllabus as per CSPC-511) 3 0 0 3 5 OE CSOE-711-E Introduction to Machine Learning (Syllabus as per CSPC-513) 3 0 0 3 6 OE CSOE-711-F Software Engineering (Syllabus as per CSPC-514) 3 0 0 3 7 OE CSOE-711-G SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE /NPTEL MOOC of 3 Credits 3 Note: Department will offer courses from the above pool of subjects to be offered in each programme elective. The courses may be more than one depending upon availability of expertise in the department. 1. The department will have a flexibility in offering Programme Elective courses (Mentioned) through SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL platforms in interest of students provided the credit courses shall be available on these platforms for that particular semester on prior information to the University. 2. The student can exercise option from 12-week courses available on SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL portal for PE-01 after due approval from the parent department of respective college of which intimation should be done to the University at the time of registration. The following points must be taken care of: a) Student registration for the above courses shall be only through the institution; it is mandatory for the student to share necessary information with the University. b) While opting the courses listed above, the institution would essentially avoid the courses offered or already studied as part",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 20
  },
  {
    "chunk_id": "0034",
    "text": "of the curriculum as it may otherwise lead to duplication and repetition of the same course. c) The institution shall designate a faculty member as a Mentor for each course to guide the students from registration till completion of the credit course. Student pursuing MOOC course through SWAYAM/ONLINE APPROVED AICTE OR UGC COURSE/NPTEL shall acquire the required credits only after successful completion of the course and submitting a certificate issued by the competent authority.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 20
  },
  {
    "chunk_id": "0035",
    "text": "20 Honours Degree Programme 1 The eligible students may register for Honours Degree courses during registration of 5th semester, at the beginning of semester. 2 Students should have passed in all courses of all previous semesters (no active backlog), and should not have been awarded \"detained\" or \"equivalent grade\" in any previous semester or should not have been involved in indiscipline or ragging activities. 3 Student should have minimum 8.0 CGPA upto last declared result to apply for Honours Degree Programme. 4 No student will be allowed to register for both Honours Degree and Minor Degree simultaneously. 5 If student fails in any course registered for title of Honours Degree, only one opportunity shall be given to student to re-appear and improve his/her CGPA so as to maintain 8 CGPA. Student registration shall be considered null and void for Honours Degree title, in case he/she fails in 2nd attempt in such subject of Honours Degree programme- whenever the results are declared. This will have no impact on his/her obtaining the Major Degree or Degree in parent department in which he/she is originally registered. 6 If student fails in more than one subject of Advanced Programme Elective Courses in Honours Degree after registering for Honours Degree, his/her registration shall be considered to have been withdrawn and he/she shall not be awarded Honours Degree title. 7 Depending upon availability of faculty in particular department of an institute, or the available infrastructure, the Departmental Undergraduate Committee (DUGC) can grant permission to student for pursuing appropriate number of SWAYAM Courses, which may be similar in content to offered Advanced Elective Courses for Honours Degrees. The information of the same has to be shared with university/institute authorities. 8 Details about the courses completed and credits earned for Honours Degree will appear only in \"8th Semester",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 21
  },
  {
    "chunk_id": "0036",
    "text": "Grade Sheet\" and \"Consolidated Grade Sheet\". These details will be listed under the heading \"Credits Earned for Honours Degree\". In the case of student who have either withdrawn from Honours Degree or become ineligible for Honours Degree, the credits earned for the courses registered and successfully completed for Honour Degree will be listed under the heading \"Additional Credits Earned\". However, such additional earned credits will not be counted in credits to be earned for Major Degree.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 21
  },
  {
    "chunk_id": "0037",
    "text": "21 Minor Degree Programme in CSE/CSE(AI&DS)/CSE(AI&ML) 1 The eligible students of other departments/programmes may register for Minor Degree courses during registration of 5th semester, at the beginning of semester. 2 Students should have passed in all courses of all previous semesters (no active backlog), and should not have been awarded \"detained\" or \"equivalent grade\" in any previous semester or should not have been involved in indiscipline or ragging activities. 3 Student should have minimum 8.0 CGPA upto last declared result to apply for Minor Degree Programme. 4 No student will be allowed to register for both Minor Degree and Honours Degree simultaneously. 5 If student fails in any course registered for title of Minor Degree, only one opportunity shall be given to student to re-appear and improve his/her CGPA so as to maintain 8 CGPA. Student registration shall be considered null and void for Minor Degree title, in case he/she fails in 2nd attempt in such subject of Minor Degree programme- whenever the results are declared. This will have no impact on his/her obtaining the Major Degree or Degree in parent department in which he/she is originally registered. 6 If student fails in more than one subject in course of Minor Degree after registering for Minor Degree, his/her registration shall be considered to have been withdrawn and he/she shall not be awarded Minor Degree title. 7 Depending upon availability of faculty in particular department of an institute, or the available infrastructure, the Departmental Undergraduate Committee (DUGC) can grant permission to student for pursuing appropriate number of SWAYAM Courses, which may be similar in content to offered courses for Minor Degree. The information of the same has to be shared with university/institute authorities. 8 Details about the courses completed and credits earned for Minor Degree will appear only in \"8th Semester",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 22
  },
  {
    "chunk_id": "0038",
    "text": "Grade Sheet\" and \"Consolidated Grade Sheet\". These details will be listed under the heading \"Credits Earned for Minor Degree\". In the case of student who have either withdrawn from Minor Degree or become ineligible for Minor Degree, the credits earned for the courses registered and successfully completed for Minor Degree will be listed under the heading \"Additional Credits Earned\". However, such additional earned credits will not be counted in credits to be earned for Major Degree.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 22
  },
  {
    "chunk_id": "0039",
    "text": "22 Honors/Minor Degree in Data Science Courses S. No. Category Subject Code Sem Subject Title Teaching Hours Per Week Credits L T P/D 1 HD/MD DSHD-511/ DSMD-511 V Introduction to AI and ML or Swayam Course/Approved online course 3 1 0 4 2 HD/MD DSHD-512/ DSMD-512 V Introduction to Data Science or Swayam Course/Approved online course 3 1 0 4 3 HD/MD DSHD-611/ DSMD-611 VI Computational Data analytics or Swayam Course/Approved online course 3 0 0 3 4 HD/MD DSHD-612/ DSMD-612 VI Web Data Mining or Swayam Course/Approved online course 3 1 0 4 5 HD/MD DSHD-711/ DSMD-711 VII Analysing, Visualizing and Applying data science with Python or Swayam Course/Approved online course 3 0 0 3 Total Credits 18 * The SWAYAM/SWAYAM PLUS Course can be opted by student after due consultation with DUGC of their parent department.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 23
  },
  {
    "chunk_id": "0040",
    "text": "23 Honors/Minor Degree in Artificial Intelligence and Machine Learning Courses S. No. Category Subject Code Semester Subject Title Teaching Hours Per Week Credits L T P/D 1 HD/MD MLHD-511/ MLMD-511 V Introduction to AI & ML or Swayam Course/Approved online course 3 1 0 4 2 HD/MD MLHD-512/ MLMD-512 V Introduction to Data Science or Swayam Course/Approved online course 3 1 0 4 3 HD/MD MLHD-612/ MLMD-612 VI Special topics in Artificial Intelligence or Swayam Course/Approved online course 3 0 0 3 4 HD/MD MLHD-611/ MLMD-611 VI Deep Learning and Neural Networks or Swayam Course/Approved online course 3 1 0 4 5 HD/MD MLHD-711/ MLMD-711 VII Applications of AI or Swayam Course/Approved online course 3 0 0 3 Total Credits 18",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 24
  },
  {
    "chunk_id": "0041",
    "text": "24 SEMESTER V CSPC-511 Computer Networks Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  The objective of the course is to equip the students with a general overview of the concepts and fundamentals of computer networks.  Familiarize the students with the standard models for the layered approach to communication between machines in a network and the protocols of the various layers. Unit-I Introductory Concepts: Goals and Applications of Networks, LAN, WAN, MAN, Wireless network, Network software: Protocol hierarchies, design issues of layers, Interfaces and services. Reference Model: The OSI reference model, TCP/IP reference model Physical Layer: Data Modems, Multiplexing Techniques, Frequency Division, Multiplexing Hierarchies, Transmission Media, Error Detection: Parity Check Codes, Cyclic Redundancy Codes. Unit-II Data Link Layer: Data link layer design issues, services provided to network layers, Framing, Error control, Flow control, Error detection and correction, Elementary data link protocols, An unrestricted Simplex protocol, A Simplex Stop-and-Wait protocol,",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 25
  },
  {
    "chunk_id": "0042",
    "text": "Simplex Protocol for a noisy channel, Sliding Window protocols, A one-bit Sliding protocol, A protocol using go-back-N, A protocol using selective repeat, Protocol specification and verification, Example data link protocol- HDLC, PPP and SLIP Unit-III Network Layer: Design issues, Routing algorithms, Congestion Control Algorithms, Quality of Service, Internetworking. Transport Layer: Transport services, Design issues, elements of transport protocols, simple transport protocols, Connection management, TCP, UDP.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 25
  },
  {
    "chunk_id": "0043",
    "text": "25 Unit-IV Session, Presentation and Application Layer: Session Layer, Design issues, remote procedure call. Presentation Layer, Design issues, Data compression techniques, cryptography. Application Layer - File Transfer, Access and Management, Electronic mail, Virtual Terminals, Other applications Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Gain the knowledge of the basic computer network technology.  Gain the knowledge of the functions of each layer in the OSI and TCP/IP reference model.  Obtain the skills of sub netting and routing mechanisms.  Familiarity with the essential protocols of computer networks, and how they can be applied in network design and implementation. Textbooks:  Computer Networks—Andrew S Tanenbaum, David.j. Wetherall,5thEdition. Pearson Education/PHI Reference Books:  An Engineering Approach to Computer Networks- S.Keshav, 2ndEdition, Pearson Education  Data Communications and Networking – Behrouz A. Forouzan. Third Edition TMH.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 26
  },
  {
    "chunk_id": "0044",
    "text": "26 CSPC-512 Theory of Computation Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  To provide introduction to some of the central ideas of theoretical computer science from the perspective of formal languages.  To introduce the fundamental concepts of formal languages, grammars and automata theory, classify machines by their power to recognize languages.  Employ finite state machines to solve problems in computing, and to understand deterministic and non-deterministic machines.  To understand the differences between decidability and undecidability. Unit-I Fundamentals: Automata Definition, applications, finite state machine, definitions, finite automaton model, acceptance of strings, deterministic finite automaton and non deterministic finite automaton, transition diagrams. Finite Automata: NFA with ᴧ-transitions, equivalence of NFA & DFA, equivalence between NFA with and without ᴧ-transitions, minimization of FSM, equivalence between two FSMs, finite automata with output- Moore and Melay machines. Unit-II Regular Languages: Regular sets, regular expressions, identity rules, constructing finite automata for a",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 27
  },
  {
    "chunk_id": "0045",
    "text": "given regular expressions, Arden’s theorem, conversion of finite automata to regular expressions, pumping lemma of regular sets, closure properties of regular sets (proofs not required), Myhill-Nerode theorem and minimization of finite automata, minimization algorithm. Unit-III",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 27
  },
  {
    "chunk_id": "0046",
    "text": "27 Grammar Formalism: Regular grammars-right linear and left linear grammars, equivalence between regular linear grammar and FA, inter conversion, context free grammar, derivation trees, sentential forms, right most and leftmost derivation of strings. Context Free Grammars: Ambiguity in context free grammars, minimization of context free grammars, Chomsky normal form, Greibach normal form. Push Down Automata: Push down automata, definition, model, acceptance of CFL, acceptance by final state and acceptance by empty state and its equivalence, applications of push down machines. Unit-IV Turing Machine: Turing Machine, definition, model, design of TM, types of turing machines (proofs not required), post correspondence problems and halting problem of turing machine. Chomsky Hierarchies: Chomsky hierarchies of grammars, unrestricted grammars, context sensitive languages, relation between languages of classes. Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Able to understand the concept of abstract machines and their power to recognize the languages.  Able to employ finite state machines for modeling and solving computing problems.  Able to design context free grammars for formal languages.  Able to distinguish between decidability and undecidability.  Able to gain proficiency with mathematical tools and formal methods. Textbooks:  Introduction to Automata Theory, Languages, and Computation, 3rd Edition, John E. Hopcroft, Rajeev Motwani, Jeffrey D. Ullman, Pearson Education.  Theory of Computer Science – Automata languages and computation, Mishra and Chandrashekaran, 2nd edition, PHI. Reference Books:  Introduction to Languages and The Theory of Computation, John C Martin, TMH.  Introduction to Computer Theory, Daniel I.A. Cohen, John Wiley.  A Text book on Automata Theory, P. K. Srimani, Nasir S. F. B, Cambridge University Press.  Introduction to the Theory of Computation, Michael Sipser, 3rd edition, Cengage Learning.  Introduction to Formal languages Automata Theory and Computation Kamala Krithivasan, Rama",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 28
  },
  {
    "chunk_id": "0047",
    "text": "R, Pearson.  K. L. P Mishra, N. Chandrashekaran (2003), Theory of Computer Science-Automata Languages and Computation, 2nd edition, Prentice Hall of India, India.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 28
  },
  {
    "chunk_id": "0048",
    "text": "28 CSPC-513 Introduction to Machine Learning Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit- III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  To review and strengthen important mathematical concepts required for ML.  Introduce the concept of learning patterns from data and develop a strong theoretical foundation for understanding state of the art Machine Learning algorithms. Unit-I Introduction: Machine Learning Paradigms: Introduction to machine learning, data sets, feature sets, data set division-test, train and validation sets, Cross Validation, applications of Machine Learning, process involved in machine learning, Types. Unit-II Supervised Learning: Classification and Regression: K- Nearest neighbor, Linear regression, multi- linear Regression, Logistic Regression, Support Vector Machine (SVM), Decision Trees, Naïve Bayes algorithm, Random Forest Algorithm. Unit-III Unsupervised learning: Types: Clustering, Association, dimensionality reduction, Clustering Hierarchical- Agglomerative clustering and divisive clustering, Partitional clustering. Clustering Algorithms: K-means clustering, mean -shift algorithm, hierarchical clustering. Association rules. Dimensionality Reduction: PCA, k-nearest neighbors and discriminant analysis. Unit-IV Reinforcement learning: Types of",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 29
  },
  {
    "chunk_id": "0049",
    "text": "reinforcement learning: positive and negative, reinforcement learning. Algorithms models: model based and model free algorithms, on policy and off policy, Markov decision process, Q Learning, Application of reinforcement Learning.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 29
  },
  {
    "chunk_id": "0050",
    "text": "29 Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Design and implement machine learning solutions to classification, regression and clustering problems.  Evaluate and interpret the results of the different ML techniques.  Design and implement various machine learning algorithms in a range of Real-world applications. Textbooks:  Machine Learning, Tom M. Mitchell, MGH.  Kevin Murphy, Machine Learning: A Probabilistic Perspective, MIT Press, 2011.  RS Suttonand, A. G. Barto., “Reinforcement Learning-An Introduction”, MIT Press.1998  Vaibhav, “Supervised Larning with Python: Concepts and Practical Implementation using Python”.  Yuxi (Hayden) Liu, “Python Machine Learning by Example”, Packet Publishing Limited, 2017.  Tom Mitchell, Machine Learning, McGraw Hill, 2017.  Christopher M. Bishop, Pattern Recognition and Machine Learning, Springer, 2011.  T. Hastie, R. Tibshirani, J. Friedman. The Elements of Statistical Learning, 2e, 2011.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 30
  },
  {
    "chunk_id": "0051",
    "text": "30 CSPC-514 Software Engineering Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  The aim of the course is to provide an understanding of the working knowledge of the techniques for estimation, design, testing and quality management of large software development projects.  Topics include process models, software requirements, software design, software testing, software process/product metrics, risk management, quality management and UML diagrams.  These practices help in developing large size and complex software.  With concepts and knowledge gained from this course, one can easily become part of industrial software production. Unit-I Introduction to Software Engineering: The evolving role of software, changing nature of software, software myths. A Generic view of process: Software engineering- a layered technology, a process framework, the capability maturity model integration (CMMI), process patterns, process assessment, personal and team process models. Software Development Processes: Waterfall model, Incremental Models – Iterative Model and RAD Model, Evolutionary Models",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 31
  },
  {
    "chunk_id": "0052",
    "text": "– Prototype and Spiral Model, Component Based Development, Unified Process, Rapid Software Development. Software Requirements: Functional and non-functional requirements, user requirements, system requirements, interface specification, the software requirements document. Unit-II Requirements engineering process: Feasibility studies, requirements elicitation and analysis, requirements validation, requirements management. System models: Context models, behavioral models, data models, object models, structured methods. Software architecture, data design, architectural styles and patterns, architectural design, conceptual model of UML, basic structural modeling, class diagrams, sequence diagrams, collaboration diagrams, use case diagrams, component diagrams. Unit-III",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 31
  },
  {
    "chunk_id": "0053",
    "text": "31 Testing Strategies: A strategic approach to software testing, test strategies for conventional software, black-box and white-box testing, validation testing, system testing, the art of debugging. Product metrics: Software quality, metrics for analysis model, metrics for design model, metrics for source code, metrics for testing, metrics for maintenance. Unit-IV: Metrics for Process and Products: Software measurement, metrics for software quality. Risk management: Reactive Vs proactive risk strategies, software risks, risk identification, risk projection, risk refinement, RMMM, RMMM plan. Quality Management: Quality concepts, software quality assurance, software reviews, formal technical reviews, statistical software quality assurance, software reliability, the ISO 9000 quality standards. Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Get familiar with various software development process models, requirement engineering concepts and software design principles.  Understand software project metrics, quality concepts and estimate effort in software development.  Understand software design and principles.  Understand coding practices, styles and software testing approaches.  Develop software cooperatively in a team with an understanding about software risk. Textbooks:  Software Engineering, A practitioner’s Approach- Roger S. Pressman, 6th edition, Mc Graw Hill International Edition.  Software Engineering- Sommerville, 7th edition, Pearson Education.  The unified modeling language user guide Grady Booch, James Rambaugh, Ivar Jacobson, Pearson Education. Reference Books:  Software Engineering, an Engineering approach- James F. Peters, Witold Pedrycz, John Wiley.  Software Engineering principles and practice- Waman S Jawadekar, The Mc Graw-Hill Companies.  Fundamentals of object-oriented design using UML Meiler page-Jones: Pearson Education.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 32
  },
  {
    "chunk_id": "0054",
    "text": "32 CSPC-515 Data Warehouse and Data Mining Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives: 1. Study data warehouse principles and its working. 2. Learn Data mining concepts and understand Association Rule Mining. 3. Study Classification Algorithms. 4. Gain knowledge of how data is grouped using clustering techniques. Unit-I Data warehouse: Introduction to Data warehouse, Difference between operational database systems and data warehouses, Data warehouse Characteristics, Data warehouse Architecture and its Components, Extraction-Transformation-Loading, Logical(Multi-Dimensional), Data Modeling, Schema Design, Star and Snow-Flake Schema, Fact Constellation, Fact Table, Fully Addictive, Semi-Addictive, Non Addictive Measures; Fact-Less-Facts, Dimension Table Characteristics; OLAP Cube, OLAP Operations, OLAP Server Architecture-ROLAP, MOLAP and HOLAP. Unit-II Data Mining: Fundamentals of data mining, Data Mining Functionalities, Classification of Data Mining systems, Data Mining Task Primitives, Integration of a Data Mining System with a Database or Data Warehouse System, Major issues in Data Mining. Data Preprocessing: Need for Data Preprocessing, Data Cleaning,",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 33
  },
  {
    "chunk_id": "0055",
    "text": "Data Integration and Transformation, Data Reduction Techniques, Data Discretization and Concept Hierarchy Generation. Unit-III Association Rules: Problem Definition, Frequent Item Set Generation, Association Rule Generation, APRIOIRI Algorithm, The Partition Algorithms, Closed Frequent Item Set. Classification: Problem Definition, General Approaches to solving a classification problem, Evaluation of Classifiers, Classification techniques, Decision Trees-Decision tree Construction, Naive-Bayes Classifier, Bayesian Belief Networks, K- Nearest neighbor classification-Algorithm and Characteristics. Prediction: Accuracy and Error measures.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 33
  },
  {
    "chunk_id": "0056",
    "text": "33 Unit-IV: Clustering: Overview of Clustering, Categorization of Major Clustering Methods, Partitioning Methods: (K-Means Algorithm, PAM (Partitioning Around Medoids)), Hierarchical Methods: (Agglomerative, Divisive Clustering). Advanced Topics and Applications: Web Mining: Web Terminology and Characteristics, Types of Web Mining: (Web Content Mining , Web Usage Mining, Web Structure Mining) , Web Mining Software. Text Mining: Definition and Importance, Applications: (Search Engines, Sentiment Analysis, Spam Filtering). Real-world Applications: Business Intelligence, Healthcare Analytics, Cyber security Threat Detection Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Understand and apply concepts of data warehousing architecture and schema modeling.  Perform data preprocessing techniques and integrate mining systems with warehouses.  Implement association, classification, and prediction algorithms.  Apply clustering techniques to uncover hidden patterns in data.  Analyze applications of web and text mining in real-world domains. Text Books/Reference books:  TEXT BOOKS:  Data Mining- Concepts and -1.chniques- Jiawei Han, Micheline Kamber, Morgan Kaufmann Publishers, Elsevier, 2 Edition, 2006.  Introduction to Data Mining, Psng-Ning Tan, Vipin Kumar, Michael Steinbanch, Pearson Educatior. REFERENCE BOOKS:  Data Mining Techniques, Arun K Pujari, 3rd Edition, Universities Press.  Data Warehousing Fundament's, Pualraj Ponnaiah, Wiley Student Edition.  The Data Warehouse Life Cycle Toolkit — Ralph Kimball, Wiley Student Edition.  Data Mining, Vikaram Pudi, P Rddha Krishna, Oxford University Press",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 34
  },
  {
    "chunk_id": "0057",
    "text": "34 CSPC-511P Computer Networks Lab Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P C Internal Assessment End Semester Examination Total 0 0 2 1 Maximum Marks: 30 Maximum Marks: 20 50 2 Hours Minimum Marks: 12 Minimum Marks: 08 20 Following is the list of experiments out of which minimum 08 experiments must be performed in the lab. The additional experiments may be performed by the respective institution depending on the infrastructure available. List of experiments: 1. Familiarization with networking components and devices: LAN adapters, hubs, switches, routers etc 2. Familiarization with transmission media and tools: Co-axial cable, UTP cable, crimping tool, connectors etc. 3. Preparing straight and cross cables. 4. Implementation of various LAN topologies using network devices, cables and computers. 5. Configuration of TCP/IP protocols in Windows and Linux. 6. Implementation of directory/file and printer sharing. 7. Designing and implementing class A, B, C networks 8. Subnet planning and its implementation 9. To plan IPv6 address scheme for a local area network comprising of n terminals. 10. Configuration a switch, router",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 35
  },
  {
    "chunk_id": "0058",
    "text": "35 CSPC-513P Machine Learning Lab Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P C Internal Assessment End Semester Examination Total 0 0 2 1 Maximum Marks: 30 Maximum Marks: 20 50 2 Hours Minimum Marks: 12 Minimum Marks: 08 20 Following is the list of experiments out of which minimum 08 experiments must be performed in the lab. The additional experiments may be performed by the respective institution depending on the infrastructure available. List of experiments: 1. Write a python program to import and export data using Panda’s library functions. 2. Demonstrate various data pre-processing techniques for a given dataset. 3. Implement Simple and Multiple Linear Regression Models. 4. Develop Logistic Regression Model for a given dataset. 5. Develop Decision Tree Classification model for a given dataset and use it to classify a new sample. 6. Implement Naïve Bayes Classification in Python 7. Build KNN Classification model for a given dataset. 8. Implement Dimensionality reduction using Principal Component Analysis (PCA) method. 9. Write a python program to implement K-Means clustering Algorithm. 10. Design and Implement Q-Learning Algorithm for Reinforcement Learning",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 36
  },
  {
    "chunk_id": "0059",
    "text": "36 SEMESTER VI CSPC-611 Cloud Computing Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  To provide a foundational understanding of cloud computing concepts, architecture, service models, and deployment types.  To introduce students to virtualization technologies and their role in enabling scalable and efficient cloud infrastructures.  To develop an understanding of cloud adoption drivers, challenges, and the governance mechanisms required in enterprise environments.  To impart knowledge about cloud security principles, including infrastructure, application, data security, and identity and access management.  To familiarize students with privacy issues, legal and regulatory frameworks, and audit and compliance requirements in cloud computing environments. Unit-I Introduction to Cloud Computing: Online social networks and applications, cloud introduction and overview, different clouds, risks, novel applications of cloud computing. Cloud Computing Architecture: Introduction cloud computing architecture, on demand computing virtualization at the infrastructure level, CPU virtualization, discussion on hypervisors storage virtualization, the SPI framework for",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 37
  },
  {
    "chunk_id": "0060",
    "text": "cloud computing, the cloud services delivery model Unit-II Cloud Deployment Models: Key drivers to adopting the cloud, the impact of cloud computing on users, governance in the cloud, barriers to cloud computing adoption in the enterprise. Security Issues in Cloud Computing: Security in cloud computing environment, infrastructure security: the network level, the host level, the application level, data security and storage, aspects of data security, data security mitigation provider data and its security. Unit-III",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 37
  },
  {
    "chunk_id": "0061",
    "text": "37 Identity and Access Management: Trust boundaries and IAM, IAM challenges, relevant IAM standards and protocols for cloud services, IAM practices in the cloud, cloud authorization management. Security Management in the Cloud: Security management standards, security management in the cloud, availability management: SaaS, PaaS, IaaS Text Books: Reference Books: Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Understand the fundamentals and architecture of cloud computing, including service models (SaaS, PaaS, IaaS), virtualization, and cloud deployment models.  Analyze the security challenges in cloud environments across infrastructure, network, host, and application levels, and propose suitable mitigation strategies.  Evaluate identity and access management (IAM) techniques and apply relevant standards and protocols for secure cloud operations.  Assess privacy concerns and legal/regulatory issues related to data storage, processing, and lifecycle in cloud computing.  Demonstrate knowledge of cloud governance, compliance, and auditing practices including GRC frameworks and the role of cloud security alliances. Textbooks:  John Rhoton,Cloud Computing Explained‖, Implementation Handbook for Enterprises.  Tim Mather, ―Cloud Security and Privacy: An Enterprise Perspective on Risks and Compliance‖, (Theory in Practice), ISBN-10: 0596802765, O‘Reilly Media  Cloud Application Architectures: Building Applications and Infrastructure in the Cloud‖, Publisher: O‘Reilly Media; ISBN-10: 0596156367, ISBN-13: 978-0596156367 Reference Books:  Barrie Sosinsky, ―Cloud Computing Bible‖, Wiley Publication, ISBN-10: 0470903562  Timothy Chou, ―Introduction to Cloud Computing. Unit-IV Privacy Issues: Privacy issues, data life cycle, key privacy concerns in the cloud, protecting privacy, changes to privacy risk management and compliance in relation to cloud computing, legal and regulatory implications, U.S. laws and regulations, international laws and regulations. Audit and Compliance: Internal policy compliance, governance, risk, and compliance (GRC), regulatory/external compliance, cloud security alliance, auditing the cloud for compliance, security as a cloud.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 38
  },
  {
    "chunk_id": "0062",
    "text": "38 CSPC-612 Compiler Design Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  To teach concepts of language translation and phases of compiler design.  To inculcate knowledge of common forms of parsers, parsing LL parser and LR parser.  To demonstrate intermediate code using technique of syntax directed translation.  To illustrate the various optimization techniques for designing various optimizing compilers. Unit-I Introduction to Compilers: Definition of compiler, interpreter and its differences, Structure of a compiler, pass and phases of translation, bootstrapping, Lexical Analysis, Role of Lexical Analyzer, Input Buffering, Specification of Tokens, Recognition of Tokens, Lex, Finite Automata, Regular Expressions to Automata, Minimizing DFA. Unit-II Syntax Analysis: Parsing, Role of Parser, Grammars, Context-free grammars, derivations, ambiguity, classes of parsing, Top Down Parsing: Recursive Descent Parser, Predictive Parser-LL(1), Bottom Up Parsing: Shift Reduce Parser-LR Parser-LR(0), Introduction to SLR Parser, CLR Parser and LALR Parser, Error Handling and Recovery in Syntax",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 39
  },
  {
    "chunk_id": "0063",
    "text": "Analyzer, YACC, Precedence Parser. Unit-III Intermediate Code Generation: Syntax Directed Definitions, Evaluation Orders for Syntax Directed Definitions, Intermediate Languages: Syntax Tree, Three Address Code, Types and Declarations, Translation of Expressions, Type Checking. Unit-IV Run-Time Environment: Need for runtime memory management, Address resolution of runtime objects at compile time, Type checking, Language features influencing run time memory management. Code Generation: Storage Organization, Stack Allocation Space, Access to Non-local Data on the Stack, Heap Management, Issues in Code Generation, Design of a simple Code Generator. Code Optimization: Principal Sources of Optimization, Basic Blocks, Peep-hole optimization, DAG, Data Flow Analysis.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 39
  },
  {
    "chunk_id": "0064",
    "text": "39 Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Use compiler construction tools and describes the Functionality of each stage of compilation process.  Construct Grammars for Natural Languages and find the Syntactical Errors/Semantic errors during the compilations using parsing techniques.  Analyze different representations of intermediate code.  Construct new compiler for new languages Textbooks:  Alfred V. Aho, Ravi Sethi, Jeffrey D. Ullman (2007), Compilers Principles, Techniques and Tools, 2nd edition, Pearson Education, New Delhi, India.  Tremblay, J .P. a nd Sorenson, P .G., “ Theory and Practice o f Compiler Writing”, SR Publications.  K. L. P Mishra, N. Chandrashekaran (2003), Theory of computer science- Automata Languages and computation, 2nd edition, Prentice Hall of India, New Delhi, India. Reference Books:  Louden, K .C., “Compiler Construction: Principles and Practice”, Course Technology.  Tremblay, J.P. and Sorenson, P.G., “Parsing Techniques: A Practical Guide”, Ellis Horwood.  Andrew W. Appel (2004), Modern Compiler Implementation C, Cambridge University Press, UK.  Cooper, K .D. a nd T orczon, L., “Engineering a Compiler”, M organ Kaufmann.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 40
  },
  {
    "chunk_id": "0065",
    "text": "40 HS-611: Start-Up, Innovation and Entrepreneurship Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 0 0 3 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  Introduce fundamental entrepreneurial principles and mindsets.  Familiarize with the innovation process and opportunity identification.  Outline key financing options and institutional support for ventures.  Understand basic and critical aspects of business model development and management.  Prepare and present a compelling pitch for a new startup venture. Unit-I: Concept of Entrepreneur: Evolution of the Concept of Entrepreneur, Characteristics of Entrepreneur, Entrepreneur vs Intrapreneur, Classification of entrepreneurs, classification by Clarence Danhof, Entrepreneurial Competency and its types, Entrepreneurial Functions, Role of Entrepreneurs in the Economic Development, Factor Affecting Entrepreneurial Growth- Economic, Social, Personality, Psychological, Cultural. Recent Developments in Women Entrepreneurship (Empowerment). Unit–II: Institutional Support and Incentives to Entrepreneurs: Institutional Support, Entrepreneurship and Financial Support, Types of Finance- Short, Medium and Long Term, Working and Fixed capital Support, Need for Incentives and Subsidies, Problems with subsidies. Institutional",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 41
  },
  {
    "chunk_id": "0066",
    "text": "Framework : Department of Industries and Commerce (DIC), Objectives and Functions of following institutions - District Industries Centre (DIC), Small Industrial Development Corporation (SIDCO), National Small Industries Corporation (NSIC), Small Industries Development Bank of India (SIDBI), Khadi Village Industry Commission (KVIC), Small Industries Service Institute (SISI), The Himachal Pradesh State Industrial Development Corporation Limited (HPSIDC), National Institute for Entrepreneurship and Small Business Development (NIESBUD). Unit–III Micro Small and Medium Enterprises: Need, essential elements, and objectives of MSMEs, Role of SME in the Economic Development, Classification of MSMEs as per MSME Act 2006",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 41
  },
  {
    "chunk_id": "0067",
    "text": "41 and brief introduction of any updated acts/modifications, Credit Guarantee Fund Trust Scheme for MSMEs – Eligibility, Nature of Assistance, Industrial Estates, Startups: Definition, ‘Startup India' Scheme of Govt. (Central and H.P.), Start-up India Hub, Credit Guarantees for Start-ups, Tax exemptions, Financial funding through fund of funds, Research Parks in India, Seed Capital Assistance, Eligibility Criteria, Margin Money Schemes, Single Window System, Unit-IV: Insurance and Funding: Insurance,, Recruitment of manpower, Procurement of raw materials, Production, Marketing, Quality Assurance, Permanent Registration, Continuous Market Research, Monitoring. National Single Window System, Creation of a Project Report (activity for students), Loan and Funding schemes of India and State/H.P. Sickness, Insolvency and Bankruptcy of Industrial Units: Reasons of sickness of industries, and types of sickness/failures, Valuation and Insurance, The Insolvency and Bankruptcy Board of India (IBBI), Insolvency Professionals, Insolvency Professional Entities, Registered Valuer Organizations (RVOs), Registered Valuers, Registered Valuers Entities. Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Understand entrepreneurial concepts, characteristics, functions, and their role in economic development through self-assessment and case analysis.  Analyze institutional and financial support systems for entrepreneurs by researching and discussing relevant schemes.  Identify and classify MSMEs and comprehend government startup schemes by applying them to business model development.  Grasp key operational aspects of startups, including management, marketing, and addressing business sickness, through project planning and risk assessment.  Develop a foundational project report for a new venture by synthesizing all learned concepts and practical applications. Text Books :  Savitha Joshi, “Entrepreneurship, Innovations & Start-Ups in India”, New Century Publications, India  Dr. S.S. Khanka, “Creativity and Innovation in Entrepreneurship” S. Chand Publishers, India,  R. Duane Ireland Bruce R. Barringer, “Entrepreneurship: Successfully Launching New Ventures” Pearson Education, India, 2020  Das, Arnav, Asthana, Shishir, “Challenges in",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 42
  },
  {
    "chunk_id": "0068",
    "text": "scaling-up of early-stage start-ups, Indian Institute of Management Ahmedabad (e-project), 2021 Reference Books/Sources:  Marchand, Lorraine H, Hanc, John, “The innovation mindset: eight essential steps to transform any industry” New York Columbia University Press 2022  Bruce R. Barringer, R. Duane Ireland, “Entrepreneurship: Successfully launching new ventures”, Pearson Education, 2016  Virk, Rizwan, “Startup myths and models: what you won't learn in business school” (Vol. 1 & Vol. 2)”, HarperCollins, India 2021.  Joe Knight, Karen Berman, “Financial Intelligence for Entrepreneurs: What You Really Need to Know About the Numbers (Harvard Financial Intelligence)”, Harvard Business Review Press, 2008 (or latest edition)  Online portals - https://www.startupindia.gov.in/, www.ibbi.gov.in, www.msme.gov.in,",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 42
  },
  {
    "chunk_id": "0069",
    "text": "42 CSPC-611P Cloud Computing Lab Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P C Internal Assessment End Semester Examination Total 0 0 2 1 Maximum Marks: 30 Maximum Marks: 20 50 2 Hours Minimum Marks: 12 Minimum Marks: 08 20 Following is the list of experiments out of which minimum 08 experiments must be performed in the lab. The additional experiments may be performed by the respective institution depending on the infrastructure available. List of experiments: 1. Write a python program to import and export data using Panda’s library functions. 2. Demonstrate various data pre-processing techniques for a given dataset. 3. Implement Simple and Multiple Linear Regression Models. 4. Develop Logistic Regression Model for a given dataset. 5. Develop Decision Tree Classification model for a given dataset and use it to classify a new sample. 6. Implement Naïve Bayes Classification in Python 7. Build KNN Classification model for a given dataset. 8. Implement Dimensionality reduction using Principal Component Analysis (PCA) method. 9. Write a python program to implement K-Means clustering Algorithm. Design and Implement Q-Learni",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 43
  },
  {
    "chunk_id": "0070",
    "text": "43 CSPC-612P Compiler Design Lab Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P C Internal Assessment End Semester Examination Total 0 0 2 1 Maximum Marks: 30 Maximum Marks: 20 50 2 Hours Minimum Marks: 12 Minimum Marks: 08 20 Following is the list of experiments out of which minimum 08 experiments must be performed in the lab. The additional experiments may be performed by the respective institution depending on the infrastructure available. List of experiments: 1. Write a C Program to implement DFAs that recognize identifiers, constants, and operators of the mini language 2. Write a lex program to implement simple calculator. 3. Design a Lexical analyzer for the given language. {Note-The lexical analyzer should ignore redundant spaces, tabs and newlines. It should also ignore comments. Although the syntax specification states that identifiers can be arbitrarily long, you may restrict the length to some reasonable value.} 4. Implement the lexical analyzer using JLex, flex, flex or lex or other lexical analyzer generation tools. 5. Write a yacc program to accept given Grammer s- >aA|a,A->a. 6. Write a Program for construction of LR Parsing table using C 7. Design a Predictive Parser for the following grammar G: {E->TE’, E’ -> +TE’ | 0, T->FT’ , T’-> *FT’|0 , F-> (E) | id } 8. Design LALR bottom-up parser for the above language using tools. 9. Write program to generate machine code from the abstract syntax tree generated by the parser.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 44
  },
  {
    "chunk_id": "0071",
    "text": "44 CSEE-613P Capstone Project Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P C Internal Assessment End Semester Examination Total 0 0 4 2 Maximum Marks: 40 Maximum Marks: 60 50 2 Hours Minimum Marks: 16 Minimum Marks: 24 20 Course Objectives: To facilitate the students, learn and apply an engineering design process in electrical engineering, including project resource management. As a part of a team, the students will make a project, that emphasizes, hands-on experience, and integrates analytical and design skills. The idea is to provide an opportunity to the students to apply what they have learned throughout the course of graduate program by undertaking a specific problem. Course Description/Guidelines: Capstone Project is increasingly interdisciplinary and requires students to function on multidisciplinary teams. It is the process of devising a system, component or process to meet desired needs. It is a decision- making process (often iterative), in which the basic sciences, mathematics, and the engineering sciences are applied to convert resources optimally to meet these stated needs. It typically includes both analysis and synthesis performed in an iterative cycle. Thus, students should experience some iterative design in the curriculum. As part of their design experience, students have an opportunity to define a problem, determine the problem scope and to list design objectives. The project must also demonstrate that students have adequate exposure to design, as defined, in engineering contexts. Engineering standards and realistic constraints are critical in engineering design. The program must clearly demonstrate where standards and constraints are taught and how they are integrated into the design component of the project. The students will work in groups as:  Each group will have 4-5 students.  Each group should select their team leader and maintain daily diary.  Each Group will work under mentorship",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 45
  },
  {
    "chunk_id": "0072",
    "text": "of a faculty supervisor.  Each group must meet the assigned supervisor (2hrs slot/week) till the end of the semester (record of attendance will be maintained), as per the time slot which will be provided to them by the respective supervisor. This is mandatory requirement for the fulfilment of the attendance as well as the successful completion of the project. The faculty supervisor of the project will continuously assess the progress of the works of the assigned groups. Completed Capstone Project-I and documentation in the form of Capstone Project-I report (template is provided in annexure-I) is to be submitted at the end of semester and appear for project demonstration and viva. 1. Capstone Project Report: Students should prepare a mini project report as per the given template and guidelines. 2. PowerPoint Presentation: Prepare a PPT of around 10 slides. The PPT content must be as follows:  Project Tile, Student Details and Mentor Name (First Slide)  Introduction and Problem Statement (Max 2 Slides)  Methodology (Max 3 Slides)",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 45
  },
  {
    "chunk_id": "0073",
    "text": "45  Results and Discussion (Max 3 Slides)  Conclusion and Future Work (1 Slide) Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Develop skills necessary for structuring, managing, and executing the projects.  Design, develop, debug, document, and deliver a project and learn to work in a team environment.  Develop written and oral communication skills.  Become proficient with software development tools and environments  Apply interdisciplinary knowledge to engineering design solutions, taking into account professional and ethical issues.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 46
  },
  {
    "chunk_id": "0074",
    "text": "46 Professional Electives",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 47
  },
  {
    "chunk_id": "0075",
    "text": "47 CSPC-613-A: Digital Image Processing Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  To study the image fundamentals and mathematical transforms necessary for image processing.  To design and implement algorithms that perform basic image processing (e.g. noise removal and image enhancement) and advanced image analysis (e.g. image compression, image segmentation, Pattern Recognition).  To assess the performance of image processing algorithms and systems. Unit-I Digital Image Fundamentals: Digital Image Processing, Origins of Digital Image Processing Application of Digital Image Processing, Steps in Digital Image Processing, Components of an Image Processing System, Image formation, Image sampling and Quantization, Image transforms – Fourier transforms. Unit-II Image Enhancement Techniques: Histogram modification techniques - Image smoothening Image Sharpening - Image Restoration - Degradation Model – Noise models - Spatial filtering – Frequency domain filtering. Unit-III Image Compression & Segmentation: Compression Models - Elements of information theory, Error free Compression -Image segmentation –Detection of",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 48
  },
  {
    "chunk_id": "0076",
    "text": "discontinuities, Thresholding, Otsu’s Threshold, Region based segmentation - Morphology. Unit-IV Representation and Description: Representation schemes- Boundary descriptors- Regional descriptors - Relational Descriptors. Pattern Recognition: Classification, Structure of PR System.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 48
  },
  {
    "chunk_id": "0077",
    "text": "48 Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Learn different techniques employed for the enhancement of images.  Understand the need for image compression and to learn the spatial and frequency domain techniques of image compression.  Learn different feature extraction techniques for image analysis and recognition.  Understand the rapid advances in Machine vision. Textbooks:  Digital Image Processing by R. Gonzalez and R. E. Wood, Prentice Hall of India.  Digital Image Processing by W.K. Pratt, McGraw Hill.  Fundamentals of Digital Image Processing by A. K. Jain, Prentice Hall of India.  Pattern Recognition-Statistical, Structural and neural approach by R. Schalkoff, John Willey & Sons. Reference Books:  Feature Extraction and Image Processing for Computer Vision by M. Nixon, Academic Press.  Introductory Computer Vision and Image Procession by A. Low, McGraw Hill.  Image Processing: Analysis and Machine Vision by Milan Sonka, Roger Boyle, and Vaclav Hlavac.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 49
  },
  {
    "chunk_id": "0078",
    "text": "49 CSPE-613-B: DISTRIBUTED OPERATING SYSTEM Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives:  To introduce the fundamental concepts and architecture of Distributed Operating Systems (DOS).  To understand various mechanisms for inter-process communication and synchronization in distributed systems.  To study resource management, including process scheduling, memory allocation, and load balancing across distributed systems.  To explore the design and implementation of Distributed File Systems (DFS). : UNIT CONTENT I Introduction of Distributed Operating System (DOS): Functions of DOS, Basic concepts, goals & challenges of distributed systems, architectures of DOS, Hardware Concept, Software Concept, Design Issues Inter process communication, IPC mechanism, remote procedure calls, RPC exception handling, security issues, RPC in heterogeneous environment. II Synchronization and Processes: Introduction of synchronization, Clocks, events, Time in distributed systems Cristian’s algorithm,The Berkeley Algorithm, Network Time Protocol (NTP), Logical time and logical clocks, Lamport logical clock, vector clock, mutual exclusion, election algorithms, deadlocks in distributed systems, Process and Threads, Processor Allocation, Process Scheduling. III Distributed Shared Memory: Introduction, General Architecture of DSM systems, Design and Implementation Issues of DSM, Introduction to shared memory, consistency model, page based distributed shared memory IV Distributed File Systems: Introduction, Desirable Features of a Good Distributed File System, File models, File–Accessing Models, File – Sharing Semantics, File – Caching Schemes, File Replication, Fault Tolerance, Atomic Transaction, Design Principle. Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Gain knowledge of distributed operating system architecture (Knowledge)  Illustrate principles and importance of distributed operating system (Understand)  Implement distributed client server applications using remote method invocation (Apply) ",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 50
  },
  {
    "chunk_id": "0079",
    "text": "Distinguish between centralized systems and distributed systems (Analyze)  Create stateful and state-less applications (Create) Text Books:  Pradeep. K. Sinha: Distributed Operating Systems: Concepts and Design  Tanenbaum A, ―Distributed Operating System‖, PHI Reference Books:  Silberschatz, P.B. Galvin, ―Operating System Concepts‖, John Wiley and Sons (Asia)",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 50
  },
  {
    "chunk_id": "0080",
    "text": "50 CSPE-613-C: Advanced Computer Networks Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: This subject provides students with an in-depth knowledge about the operating system. It covers the distributed operating system in detail, including inter process communication, synchronization, shared memory and distributed file system. UNIT CONTENT I Review of computer networks and the Internet: What is the Internet? Access Networks and Physical media, ISPs and Internet Backbones, Delay and Loss circuit, message and packet switched Networks. History of computer networking and the Internet - 5-layer TCP/IP Model, 7-Layer OSI Model, Internet Protocols and Addressing, Networking Devices: Modems and Internet Access Devices, Switching and Routing Devices, Router Structure. II Data link layer protocols, bit and byte oriented, stop-and-wait, go- back-N, selective repeat and sliding window techniques- their performances with and without errors, error detection and correction, CRC, framing. Multiple Access Techniques - Introduction - Narrowband Channelized Systems – Frequency Division Multiple Access - Frequency Division Duplex (FDD) and Time Division Multiple Access - Time Division Duplex (TDD) System - Spectral Efficiency - Multiple Access Spectral Efficiency - Overall Spectral Efficiency of FDMA and TDMA Systems Wideband Systems - Comparisons of FDMA, TDMA, and DSCDMA III Access Methods - Pure ALOHA - Slotted ALOHA. Carrier Sense Multiple Access (CSMA) - Carrier Sense Multiple Access with Collision Detection - Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) - Idle Signal Casting Multiple Access – Packet Reservation Multiple Access – IEEE 802.3 – IEEE 802.4 – IEEE 802.5 – IEEE 802.11 – FDDI – SONET. IV Routing: Network–Layer Routing, Least-Cost-Path algorithms, Non- Least-Cost-Path algorithms, Intradomain Routing Protocols, Interdomain Routing Protocols, Congestion",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 51
  },
  {
    "chunk_id": "0081",
    "text": "Control at Network Layer. Wireless Networks and Mobile IP: Infrastructure of Wireless Networks Wireless LAN Technologies, IEEE 802.11 Wireless Standard, Mobile IP, Wireless Mesh Networks (WMNs), Bluetooth networks, WiMax, and RFID.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 51
  },
  {
    "chunk_id": "0082",
    "text": "51 Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Configure various networking devices and equipments.  Implement data link layer protocols.  Choose routing protocols in the given network scenarios  Implement different network and transport layer protocols.  Configure IPv6 networks  Configure wireless networks and mobile IPs Text Books:  William Stallings, Data and Computer Communication, Prentice Hall of India.  Behrouz A. Forouzan, Data Communication and Networking, McGraw-Hill.  Andrew S. Tanenbaum, Computer Networks, Prentice Hall.  James F. Kurose, Keith W.Ross, Computer Networking: A Top-Down Approach Featuringthe Internet, Pearson Education.  S.Keshav, An Engineering Approach to Computer Networking, Pearson Education.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 52
  },
  {
    "chunk_id": "0083",
    "text": "52 CSPE-613-D: Deep Learning Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives:  To understand the basics of neural networks  Comparing different deep learning models  To understand the Recurrent and Recursive nets in Deep Learning  To understand the basics of deep reinforcement learning models  To analyze Types of Networks  To describe Reinforcement Learning UNIT CONTENT I Foundations of Deep learning What is machine learning and deep learning? History of deep learning, Advantage and challenges of deep learning. Learning representations from data , Understanding how deep learning works in three figures (input, hidden layer, output), Common Architectural Principles of Deep Network, Architecture Design, Applications of Deep learning, Hyperparameters: Learning Rate, Regularization, Momentum, Sparsity, Hidden Units, cost functions, error back propagation, Gradient-Based Learning, Implementing Gradient Descent, vanishing and Exploding gradient descent, Optimization algorithm (SGD, AdaGrad, RMSProp, adam). II Deep Neural Networks (DNNs) Introduction to Neural Networks: The Biological Neuron, The Perceptron (AND, OR, NOT, XOR), Deep forward network, Multilayer Feed-Forward Networks, Training Neural Networks: Backpropagation and Forward Propagation Activation Functions: Linear, Sigmoid, Tannh, Hard Tanh, Softmax, Rectified Linear, Loss Functions: Loss Function Notation, Loss Functions for Regression, Loss Functions for Classification, Loss Functions for Reconstruction. III Convolution Neural Network (CNN) Introduction, CNN architecture overview, The Basic Structure of a Convolutional Network- Padding, Strides, Typical Settings, the ReLU layer, Pooling, Fully Connected Layers, The Interleaving between Layers, Local Response Normalization, Training a Convolutional Network Recurrent Neural Network (RNN) Recurrent and Recursive Nets: Unfolding Computational Graphs, Recurrent Neural Networks, Bidirectional RNNs, Encoder-Decoder Sequence-to-Sequence Architectures, Deep Recurrent Networks, Recursive Neural Networks, The Challenge of Long-Term Dependencies, Echo",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 53
  },
  {
    "chunk_id": "0084",
    "text": "State Networks, Leaky Units and Other Strategies for Multiple Time Scales, The Long Short-Term Memory and Other Gated RNNs, Optimization for Long-Term Dependencies, Explicit Memory.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 53
  },
  {
    "chunk_id": "0085",
    "text": "53 Practical Methodology: Performance Metrics, Default Baseline Models, Determining Whether to Gather More Data, Selecting Hyper parameters. IV Deep Generative Models Introduction to deep generative model, Boltzmann Machine, Deep Belief Networks, Generative adversarial network (GAN), discriminator network, generator network, types of GAN, Applications of GAN networks Reinforcement Learning Introduction of deep reinforcement learning, Markov Decision Process, basic framework of reinforcement learning, challenges of reinforcement learning, Dynamic programming algorithms for reinforcement learning, Q Learning and Deep Q-Networks, Deep Q recurrent networks, Simple reinforcement learning for Tic-Tac-Toe. Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  Understand the basics of Deep Learning and apply the tools to implement deep learning applications  Evaluate the performance of deep learning models  Implement the technique of Convolution neural network (CNN)  Solve the language translation problem by Recurrent neural network (RNN)  Construct new data by deep generative models  Apply on-policy reinforcement learning algorithms Text Books:  Goodfellow, I., Bengio, Y., Courville, A, “Deep Learning”, MIT Press, 2016  Josh Patterson & Adam Gibson, “Deep Learning”  Charu Agarwal, “Neural Networks and deep learning”  Nikhil Buduma, “Fundamentals of Deep Learning”, SPD  Francois chollet, “Deep Learning with Python” Reference Books:  Richard S. Sutton and Andrew G. Barto, “Reinforcement Learning: An Introduction”  SethWeidman, “Deep Learning from Scratch: Building with Python from First Principles” O‘Reily  Francois Duval, “Deep Learning for Beginners, Practical Guide with Python and Tensorflow” e- Resources:  http://csis.pace.edu/ctappert/cs855-18fall/DeepLearningPractitionersApproach.pdf  https://www.dkriesel.com/_media/science/neuronalenetze-en-zeta2-1col-dkrieselcom.pdf MOOC Courses:  Deep Learning- Part 1, IIT Madras: https://nptel.ac.in/courses/106106184  Deep Learning Specialization: https://www.coursera.org/specializations/deep-learning",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 54
  },
  {
    "chunk_id": "0086",
    "text": "54 CSPE-613-E: Augmented and Virtual Reality Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: • To study modern overviews on virtual reality and list the applications of VR. • To know the representation of the Virtual world in VR. • To Study the fundamentals of visual perception, motion and tracking in the real and virtual world. • To study modern overviews and perspectives on Augmented reality and list the applications of AR • To study the working of various state-of-the-art AR devices. • To Acquire knowledge of VR and AR application areas and their development platforms. UNIT CONTENT I Introduction to Virtual Reality Defining Virtual Reality, History of VR, Human Physiology and Perception, Key Elements of Virtual Reality Experience, Virtual Reality System, Interface to the Virtual World- Input Output- Visual, Aural & Haptic Displays, Applications of Virtual Reality. Representing the Virtual World in VR Representation of the Virtual World, Visual Representation in VR, Aural Representation in VR and Haptic Representation in VR, Geometric Models, Changing Position and Orientation, Axis-Angle Representations of Rotation, Viewing Transformations II Visual Perception, Motion and Tracking in VR Visual Perception - Perception of Depth, Perception of Motion, Perception of Color, Combining Sources of Information Visual Rendering -Ray Tracing and Shading Models. Motion in Real and Virtual Worlds, Tracking- Tracking 2D & 3D Orientation. III Introduction to Augmented Reality What Is Augmented Reality - Defining Augmented Reality, history of augmented reality, The Relationship Between Augmented Reality and Other Technologies-Media, Technologies, Other Ideas Related to the Spectrum Between Real and Virtual Worlds, Augmented Reality Concepts- How Does Augmented Reality Work? Concepts Related to Augmented Reality,",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 55
  },
  {
    "chunk_id": "0087",
    "text": "Ingredients of an Augmented Reality Experience, Applications of Augmented Reality Augmented Reality Components and Devices Augmented Reality Hardware – Displays – Audio Displays, Haptic Displays, Visual Displays, Other sensory displays, Visual Perception, Requirements and Characteristics, Spatial Display Model. Processors – Role of Processors, Processor System Architecture, Processor Specifications. Tracking & Sensors - Tracking, Calibration, and Registration, Characteristics of Tracking Technology, Stationary Tracking Systems, Mobile Sensors, Optical Tracking, Sensor Fusion. Types of AR devices.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 55
  },
  {
    "chunk_id": "0088",
    "text": "55 IV Application Development Using Augmented Reality and Virtual Reality Programming Languages for AR & VR applications: OOL concepts, C# with Unity C# for AR and VR, C++ with Unreal Engine AR App Development with Unity: SDK and Frameworks, VR Concept Integration, Setting up Unity with VR, Unity AR concepts, Working with AR Tools– ARCore, ARToolkitx ARCore, ARToolit Vuforia Trending Application Areas - Gaming and Entertainment, Architecture and Construction, Science and Engineering, Health and Medicine, Aerospace and Defence, Education, Telerobotics and Telepresence. Human Factors, Legal and Social Considerations - Human Factors Considerations, Legal and Social Considerations, The Future. Course Learning Outcomes (CLOs): After the completion of the course, the student will be able to:  CO1. Analyze how Virtual Reality systems work.  CO2. Understand the representation of the Virtual world.  CO3. Describe the importance of motion and tracking in VR systems.  CO4. Analyze how AR systems work and list the applications of AR.  CO5. Identify the working of various AR components and AR devices.  CO6. Explore the appropriate platforms for AR VR application development. Text Books:  Virtual Reality, Steven M. LaValle, Cambridge University Press, 2016  Understanding Virtual Reality: Interface, Application and Design, William R Sherman and Alan B Craig, (The Morgan Kaufmann Series in Computer Graphics)”. Morgan Kaufmann Publishers, San Francisco, CA, 2002  Augmented Reality: Principles & Practice by Schmalstieg / Hollerer, Pearson Education India; First edition (12 October 2016), ISBN-10: 9332578494  Practical Augmented Reality: A Guide to the Technologies, Applications, and Human Factors for AR and VR, Steve Aukstakalnis Addison-Wesley Professional, September 2016, ISBN: 9780134094328 7.  Beginning iOS AR Game Development Developing Augmented Reality Apps with Unity and C#, Allan Fowler, 1st Edition, Apress Publications, 2018, ISBN 978-1484236178  Learning C++ by Creating Games with UE4, William Sherif, Packt",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 56
  },
  {
    "chunk_id": "0089",
    "text": "Publishing, 2015, ISBN 978-1- 78439-657-2 Reference Books:  Developing Virtual Reality Applications: Foundations of Effective Design, Alan B Craig, William R Sherman and Jeffrey D Will, Morgan Kaufmann, 2009.  Burdea, Grigore C and Philippe Coiffet, “Virtual Reality Technology”, Wiley Interscience, India, 2003.  SanniSiltanen- Theory and applications of marker-based augmented reality. Julkaisija – Utgivare Publisher. 2012. ISBN 978-951-38-7449-0 E-Books / E-Learning References  http://lavalle.pl/vr/book.html  https://www.vttresearch.com/sites/default/files/pdf/science/2012/S3.pdf  https://nptel.ac.in/courses/106/106/106106138/  https://www.coursera.org/learn/ar  https://www.coursera.org/learn/augmented-reality",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 56
  },
  {
    "chunk_id": "0090",
    "text": "56 CSPE-613-F: Responsible and Ethical Artificial Intelligence Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. Understand the role and importance of ethics in AI systems for society and humanity. 2. Identify and mitigate bias and unfairness in AI datasets and models. 3. Comprehend privacy preservation techniques and regulatory frameworks in AI applications. 4. Evaluate AI systems for transparency, accountability, and responsible deployment Course Outcomes: 1. Explain ethical challenges in AI and their impact on society. 2. Apply fairness techniques to identify and mitigate bias in AI systems. 3. Implement privacy-preserving and explainable AI methods. 4. Evaluate AI systems for compliance with ethical, legal, and regulatory standards. UNIT CONTENT No. of Hrs. I INTRODUCTION TO RESPONSIBLE AI: Need for ethics in AI. AI for Society and Humanity, Fairness and Bias, Sources of Biases, Exploratory data analysis, limitation of a dataset, Pre-processing, in processing and post processing to remove bias, Group fairness and Individual fairness, Counterfactual fairness. 10 II AI STANDARDS AND REGULATION: International ethical initiatives-Ethical harms and concerns, Model Process for Addressing Ethical Concerns During System Design - Transparency of Autonomous Systems. 10 III INTERPRETABILITY AND EXPLAINABILITY: Need for interpretability in AI. Simplification and visualization of models. Intrinsic interpretable methods. Post hoc interpretability. Explainability through causal inference. Model-agnostic explanation techniques. 10 IV ETHICS AND ACCOUNTABILITY: Auditing AI models, fairness assessment, Principles for ethical practices, Privacy preservation: Attack models, Privacy- preserving Learning, Differential privacy, Federated 9 Text Books: 1. Responsible Artificial Intelligence: How to Develop and Use AI in a Responsible Way – Virginia Dignum, Springer Nature, 2019 2. Interpretable Machine Learning – Christoph Molnar, Lulu, 1st Edition,",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 57
  },
  {
    "chunk_id": "0091",
    "text": "2019 3. Responsible AI: Implement an Ethical Approach in Your Organization – Olivia Gambelin, Kogan Page, 2023 4. The Ethics of Artificial Intelligence – Nick Bostrom and Eliezer Yudkowsky, from Cambridge Handbook of Artificial Intelligence, 2014",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 57
  },
  {
    "chunk_id": "0092",
    "text": "57 CSPE-613-G Bayesian Learning & Decision Making Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper offend semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A,B,C,D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  To understand the fundamental principles of pattern recognition.  To explore and apply statistical approaches such as Bayesian decision theory and parameter estimation methods  To develop skills in feature selection and extraction  To introduce various unsupervised learning and clustering algorithms  To analyze and design visual recognition system Unit-I Introduction and mathematical Preliminaries: Principles ofpatiern recognition: uses. mathematics. Classification and Bayesian rules, Clustering vs classification Basics of linear algebra and vector spaces. Eigen values and eigen vectors. Rank of matrix and SVD Unit-lI Pattern Recognition basics: Bayesian decision theory, Classifiers, Discriminant functions, Deeiston surfaces, Parameter estimation methods, Hidden Markov models, dimension reduction methods, Fisher discriminant analysis, Prinelpal component analysis, non-parametric techniques for density estimatiorv nonmetric methods foc pattern classificatiorv unsupeMsed learning, algorithms for clustenng: Kmeans, Hierarchical and other methods. Unit-III Feature Selection and extraction: problem statement and uses.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 58
  },
  {
    "chunk_id": "0093",
    "text": "\"ranch and bound algorithm, Sequential and backward selection, Cauchy Schuart*. inequality, Feature selection critena iUne1.on: probabilistic separahility based and Interclass distance Feature Extraction: principles Unit-IV Visual Recognition: Human Visual recognition system. Recognition methods: I.ow-level modelling (e g Midlevel abstraction segmentation). I ligh-level reasoning (e.g. scene Understanding): DetectionkSegmentation methods: Context and scenes. Importance and saliency. scale search and recognition, Egocentric vision. systems. Human-in-the-loop interactive systems, 3D scene understanding.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 58
  },
  {
    "chunk_id": "0094",
    "text": "58 Course Outcomes: 1. CO1: Understand and apply the basic principles of pattern recognition, including classification, clustering, and Bayesian decision rules. 2. CO2: Analyze and implement various classifiers, discriminant functions, and statistical methods such as Hidden Markov Models and density estimation techniques. 3. CO3: Select and extract relevant features from data using methods like PCA, Fisher’s Discriminant Analysis, and feature selection algorithms for improving model performance. 4. CO4: Develop and evaluate clustering algorithms and unsupervised learning techniques such as K-Means and hierarchical clustering. 5. CO5: Apply visual recognition concepts to real-world scenarios involving scene understanding, object detection, egocentric vision, and 3D visual interpretation.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 59
  },
  {
    "chunk_id": "0095",
    "text": "59 CSPE-711-A-Data Science Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives: ● To teach concepts of language translation and phases of compiler design. ● To inculcate knowledge of common forms of parsers, parsing LL parser and LR parser. ● To demonstrate intermediate code using technique of syntax directed translation. ● To illustrate the various optimization techniques for designing various optimizing compilers. Unit-I Introduction to Data Science-Different Sectors using Data science, Purpose and Components of Python in Data Science. Data Analytics Process, Knowledge Check, Exploratory Data Analysis (EDA), EDA-Quantitative technique, EDA- Graphical Technique, Data Analytics Conclusion and Predictions. Unit-II Feature Generation and Feature Selection (Extracting Meaning from Data)- Motivating application: user (customer) retention- Feature Generation (brainstorming, role of domain expertise, and place for imagination)- Feature Selection algorithms. Unit-III Data Visualization- Basic principles, ideas and tools for data visualization, Examples of inspiring (industry) projects- Exercise: create your own visualization of a complex dataset.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 60
  },
  {
    "chunk_id": "0096",
    "text": "Unit-IV Applications of Data Science, Data Science and Ethical Issues- Discussions on privacy, security, ethics- A look back at Data Science- Next-generation data scientists, Skills and Roles in Modern Data Science, Responsible AI and Ethical Machine Learning, Legal and Regulatory Aspects in Data Science",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 60
  },
  {
    "chunk_id": "0097",
    "text": "60 Course Learning Outcomes: After completion of course, students would be able to: ● Explain how data is collected, managed and stored for data science; ● Understand the key concepts in data science, including their real-world applications and the toolkit used by data scientists; ● Implement data collection and management scripts using MongoDB. Text Books/References: ● Joel Grus, Data Science from Scratch, Shroff Publisher Publisher /O’Reilly Publisher Media ● Annalyn Ng, Kenneth Soo, Numsense! Data Science for the Layman, Shroff Publisher Publisher ● Cathy O’Neil and Rachel Schutt. Doing Data Science, Straight Talk from The Frontline. O’Reilly Publisher Media. ● Jure Leskovek, Anand Rajaraman and Jeffrey Ullman. Mining of Massive Datasets. v2.1, Cambridge University Press. ● Jake VanderPlas, Python Data Science Handbook, Shroff Publisher Publisher /O’Reilly Publisher Media ● Philipp Janert, Data Analysis with Open Source Tools, Shroff Publisher Publisher /O’Reilly Publisher Media.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 61
  },
  {
    "chunk_id": "0098",
    "text": "61 CSPE-711-B: Image Processing and Computer Vision Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: This subject emphasis on fundamentals of Image processing and Computer vision. Students will gain the knowledge of Image Formation, Image Enhancement and Segmentation. Students will also learn various feature extraction techniques. This subject has more emphasis on core vision tasks through Motion estimation and Object as well as pattern recognition. Students shall explore the areas where automation can be possible through Image processing and Computer Vision. Course Outcomes: On completion of the course, student will be able to 1. Understand fundamentals of image processing and computer vision. 2. Understand and apply concepts of Image formation and Image Enhancement. 3. Understand and apply image segmentation and feature extraction methods. 4. Acquire knowledge about various Object Detection, Object Recognition, Motion estimation techniques and their applications 5. Ability to apply various Image processing and Computer vision algorithms to solve real time problems UNIT CONTENT No. of Hrs. I Introduction: Digital Image fundamentals, Image Sensing and acquisition, Sampling and Quantization, Image formation models, Overview of Computer Vision, Applications of Image processing and Computer Vision 10 II Image Enhancement: Image enhancement in spatial domain, Basic grey level Transformations, Histogram Processing Techniques, Spatial Filtering, Image smoothing and Image Sharpening, Image enhancement process in frequency domain, Low pass filtering, High pass filtering Image Segmentation: point, line and edge detection, Thresholding, Regions Based segmentation, Edge linking and boundary detection 10 III Feature Extraction: Importance of Features, Feature extraction techniques, Histogram of Oriented Gradient (HOG), Scale Invariant Feature Transform (SIFT), Background subtraction techniques, Image Matching, Principal Component Analysis (PCA) Object Recognition",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 62
  },
  {
    "chunk_id": "0099",
    "text": "and Motion Estimation: Object Recognition techniques: Viola-Jones, Yolo, Deep learning algorithms for Object Recognition. Optical Flow, Gaussian Mixture Model (GMM), Structure of Motion, Motion Estimation. 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 62
  },
  {
    "chunk_id": "0100",
    "text": "62 IV Applications of Image Processing and Computer vision: Face Recognition, Facial Expression Recognition, Optical Character Recognition, Automated Video Surveillance 9 Text Books: 1. Digital Image Processing- Refael C. Gonzalez and Richard E. Woods, Wesley 2. Computer Vision - A modern approach, by D. Forsyth and J. Ponce, Prentice Hall Robot Vision, by B. K. P. Horn, McGraw-Hill. 3. Introductory Techniques for 3D Computer Vision, by E. Trucco and A. Verri, Publisher: Prentice Hall. 4. Computer Vision, D. H. Ballard, C. M. Brown, Prentice-Hall, Englewood Cliffs, 1982 Reference Books: E-Books / E-Learning References NPTEL Courses: https://onlinecourses.nptel.ac.in/noc19_cs58/preview https://onlinecourses.nptel.ac.in/noc19_ee55/preview Coursera Courses on Image Processing, Computer Vision List of Practicals / Tutorials: 1 Implement various grey level transformations for Image Enhancement. 2 Implement Histogram Equalization technique. 3 Write a Program to apply convolution processes on an input image for image smoothing. 4 Implement Histogram of Oriented Gradient (HOG) for Feature extraction. 5 Write a Program to apply Scale Invariant Feature Transform on input image. 6 Implement frame differencing technique for background subtraction from video. 7 Implement Principal Component Analysis for the computation of Eigenvector to reduce the dimensionality. 8 Implement object detection algorithm YOLO. 9 Implement R-CNN algorithms for object detection. 10 Implement motion estimation using optical flow technique. 11 Implement Object recognition. 12 Implement Facial Expression Recognition.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 63
  },
  {
    "chunk_id": "0101",
    "text": "63 CSPE-711-C: Advanced Computer Architecture Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objective: ● Impart the concepts and principles of parallel and advanced computer architectures. ● Develop the design techniques of Scalable and multithreaded Architectures. ● Apply the concepts and techniques of parallel and advanced computer architectures to design modern computer systems Learning Course Outcome: After successful completion of the course, students will able to: 1. Demonstrate concepts of parallelism in hardware/software. 2. Computational models and Computer Architectures. 3. Concepts of parallel computer models. 4. Describe architectural features of advanced processors. 5. Interpret performance of different pipelined processors. 6. Scalable Architectures, Pipelining, Superscalar processors UNIT CONTENT No. of Hrs. I SIMD/ PRAM/ VLSI models Theory of Parallelism, Parallel computer models, The State of Computing, Multiprocessors and Multicomputers, Multivector and SIMD Computers, PRAM and VLSI models, Architectural development tracks, Program and network properties, Conditions of parallelism, Program partitioning and Scheduling, Program flow Mechanisms, System interconnect Architectures 10 II Principles of Scalable performance Performance metrics and measures, Parallel Processing applications, Speed up performance laws, Scalability Analysis and Approaches, Hardware Technologies, Processes and Memory Hierarchy, Advanced Processor Technology, Superscalar and Vector Processors. 10 III Shared-Memory Organizations Sequential and weak consistency models, Pipelining and superscalar techniques, Linear Pipeline Processors, Non-Linear Pipeline Processors, Instruction Pipeline design, Arithmetic pipeline design, superscalar pipeline design. 10 IV Parallel and Scalable Architectures Multiprocessors and Multicomputers, Multiprocessor system interconnects, cache coherence and synchronization mechanism, Three Generations of Multicomputers, 9",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 64
  },
  {
    "chunk_id": "0102",
    "text": "64 Message-passing Mechanisms, Multivetor and SIMD computers Vector Processing Principles Multivector Multiprocessors, Compound Vector processing, SIMD computer Organizations, The connection machine CM-5 Text Books: 1. Advanced Computer Architecture, Kai Hwang, 2nd Edition, Tata McGraw Hill Publisher Reference Books: 1. Computer Architecture, J.L. Hennessy and D.A. Patterson, 4th Edition, ELSEVIER. 2. Advanced Computer Architectures, S.G.Shiva, Special Indian edition, CRC, Taylor &Francis. 3. Introduction to High Performance Computing for Scientists and Engineers, G. Hager and G. Wellein, CRC Press, Taylor & Francis Group. 4. Advanced Computer Architecture, D. Sima, T. Fountain, P. Kacsuk, Pearson education. 5. Computer Architecture, B. Parhami, Oxford Univ. Press.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 65
  },
  {
    "chunk_id": "0103",
    "text": "65 CSPE-711-D: Mobile Computing and Wireless Networks. Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objective: ● To know the details of TCP/IP ● Understand working of Internet ● Know application of TCP/IP ● Manage TCP/IP and prepare foundation for future Networks STUDENTS LEARNING OUTCOMES: 1. On successful completion of the course, the student will be having the basic knowledge of TCP/IP protocol suite and will understand the working of internet. 2. Student will be able to manage any TCP/IP network and also design optimized TCP/IP network. UNIT CONTENT No. of Hrs. I Introduction to Mobile Computing: Emerging Technologies, GSM, SMS, GPRS, EDGE, 3G, 4G Multiple Access Techniques: Frequency Division Multiple access, Time Division Multiple Access, Aloha, Slotted Aloha, CSMA 10 II Mobile Network And Transport Layer Mobile IP- Goals and requirements, Entities, IP packet delivery, Agent Discovery, Registration, Tunneling and Encapsulation, Optimizations, Reverse Tunneling, IP micro-mobility support. DHCP: Traditional TCP-Congestion Control, Slow start, Fast retransmit/fast recovery, Implications of mobility, Classical TCP- Indirect TCP, snooping TCP, Mobile TCP, Transmission/time out freezing and advancements 10 III Mobile Ad hoc Network: Introduction, Routing protocols- Routing, Dynamic source routing, Destination sequence distance vector, Overview ad-hoc routing protocols, Application- RFID, Bluetooth, Zigbee, NFC 10 IV Wireless Networking: Introduction to Wireless Networking, History of wireless networks, Difference between Wireless and Fixed Telephone Networks, Development of Wireless Networks, Wireless Network Architecture, Benefits of Wireless Networks, Wireless Networking Applications Wireless Networks: Introduction, Wireless Technology Satellite Communications: Parameters & configurations, Capacity Allocation Cellular Wireless Networks : Principles, Evolution Wireless LANs: Technology, IEEE 802.11 Wireless LAN Standard, Radio based Wireless LANs, Components, Configuration, Performance, Wi-Fi, Wimax 9",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 66
  },
  {
    "chunk_id": "0104",
    "text": "66 Text Books: 1. Wireless Communications and Networks William Stallings Pearson Education 2. Mobile Communications Jochen Schiller Pearson 3. Wireless Communications Principles and Practice Theodore S. Rappaport. 4. Wireless Networking Kumar, Manjunath & Kuri, Morgan Kaufmann Publishers 5. Mobile Computing , Asoke K Telukder, Roopa R Yavagal, TMH",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 67
  },
  {
    "chunk_id": "0105",
    "text": "67 CSPE-711-E: Natural Language Processing Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. To be familiar with fundamental concepts and techniques of natural language processing (NLP) 2. To acquire the knowledge of various morphological, syntactic, and semantic NLP tasks 3. To develop the various language modeling techniques for NLP 4. To use appropriate tools and techniques for processing natural languages 5. To comprehend the advance real world applications in NLP domain. 6. To Describe Applications of NLP and Machine Translations. Course Outcomes: On completion of the course, students will be able to– CO1. Describe the fundamental concepts of NLP, challenges and issues in NLP. CO2. Analyze Natural languages morphologically, syntactical and semantically CO3. Illustrate various language modelling techniques CO4. Integrate the NLP techniques for the information retrieval task. CO5. Demonstrate the use of NLP tools and techniques for text-based processing of natural languages. CO6. Develop real world NLP applications. UNIT CONTENT No. of Hrs. I Introduction to Natural Language Processing Introduction: Natural Language Processing, Why is NLP hard? Programming languages Vs Natural Languages, Are natural languages regular? Finite automata for NLP, Stages of NLP, Challenges and Issues (Open Problems) in NLP Basics of text processing: Tokenization, Stemming, Lemmatization, Part of Speech Tagging 10 II Language Syntax and Semantics Morphological Analysis: What is Morphology? Types of Morphemes, Inflectional morphology & Derivational morphology, Morphological parsing with Finite State Transducers (FST) Syntactic Analysis: Syntactic Representations of Natural Language, Parsing Algorithms, Probabilistic context-free grammars, and Statistical parsing Semantic Analysis: Lexical Semantic, Relations among lexemes & their senses Homonymy, Polysemy, Synonymy, Hyponymy, WordNet, Word Sense Disambiguation (WSD), Dictionary based approach, Latent",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 68
  },
  {
    "chunk_id": "0106",
    "text": "Semantic Analysis 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 68
  },
  {
    "chunk_id": "0107",
    "text": "68 III Language Modelling Probabilistic language modelling, Markov models, Generative models of language, Log-Liner Models, Graph-based Models N-gram models: Simple n-gram models, Estimation parameters and smoothing, Evaluating language models, Word Embeddings/ Vector Semantics: Bag-of-words, TFIDF, word2vec, doc2vec, Contextualized representations (BERT) Topic Modelling: Latent Dirichlet Allocation (LDA), Latent Semantic Analysis, Non Negative Matrix Factorization. Information Retrieval using NLP Information Retrieval: Introduction, Vector Space Model Named Entity Recognition: NER System Building Process, Evaluating NER System Entity Extraction, Relation Extraction, Reference Resolution, Coreference resolution, Cross Lingual Information Retrieval 10 IV NLP Tools and Techniques Prominent NLP Libraries: Natural Language Tool Kit (NLTK), spaCy, TextBlob, Gensim etc. Linguistic Resources: Lexical Knowledge Networks, WordNets, Indian Language WordNet (IndoWordnet), VerbNets, PropBank, Treebanks, Universal Dependency Treebanks Word Sense Disambiguation: Lesk Algorithm WordNets for Word Sense Disambiguation Applications of NLP Machine Translation: Rule based techniques, Statistical Machine Translation (SMT), Cross Lingual Translation Sentiment Analysis, Question Answering, Text Entailment, Discourse Processing, Dialog and Conversational Agents, Natural Language Generation 9 Text Books: 1. Jurafsky, David, and James H. Martin Speech and Language Processing: An Introduction to Natural Language Processing, Computational Linguistics and Speech PEARSON Publication 2. Manning, Christopher D., and nrich Schütze Foundations of Statistical Natural Language Processing, Cambridge, MA: MIT Press Reference Books: 1. Steven Bird, Ewan Klein, Edward Loper Natural Language Processing with Python Analysing Text with the Natural Langua Publication 2. Dipanjan text Analytics with Python: A Practical Real-World Approach to Gaining Actionable Insights from your Publication ISBN: 9781484223871 3. Alexander Clark, Chris Fox, and Shalom Lappin The Handbook of Computational Linguistics and Natural Language Processing, Wiley Blackwell Publications 4. Jacob Eisenstein Natural Language Processing, MIT Press 5. Jacob Eisenstein An Introduction to Information Retrieval Cambridge University Press",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 69
  },
  {
    "chunk_id": "0108",
    "text": "69 E Books / E Learning References: 1. https://web.stanford.edu/~jurafsky/slp3/ed3book.pdf 2. https://www3.cs.stonybrook.edu/~cse521/L16NLP.pdf 3. https://nptel.ac.in/courses/106101007 4. https://nptel.ac.in/courses/106106211",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 70
  },
  {
    "chunk_id": "0109",
    "text": "70 Teaching Scheme Credit CSPE-711-F: INTERNET OF THINGS Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. To introduce the terminology, technology and its applications 2. To introduce the concept of M2M (machine to machine) with necessary protocols 3. To introduce the Python Scripting Language which is used in many IoT devices 4. To introduce the Raspberry PI platform, that is widely used in IoT applications 5. To introduce the implementation of web based services on IoT devices Course Outcomes: 1. Interpret the impact and challenges posed by IoT networks leading to new architectural models. 2. Compare and contrast the deployment of smart objects and the technologies to connect them to network. 3. Appraise the role of IoT protocols for efficient network communication. 4. Elaborate the need for Data Analytics and Security in IoT. 5. Illustrate different sensor technologies for sensing real world entities and identify the 6. applications of IoT in Industry. UNIT CONTENT No. of Hrs. I Introduction to Internet of Things –Definition and Characteristics of IoT, Physical Design of IoT – IoT Protocols, IoT communication models, Iot Communication APIs IoT enabaled Technologies – Wireless Sensor Networks, Cloud Computing, Big data analytics, Communication protocols, Embedded Systems, IoT Levels and Templates Domain Specific IoTs – Home, City, Environment, Energy, Retail, Logistics, Agriculture, Industry, health and Lifestyle 10 II IoT and M2M – Software defined networks, network function virtualization, difference between SDN and NFV for IoT Basics of IoT System Management with NETCOZF, YANG- NETCONF, YANG, SNMP NETOPEER 10 III Introduction to Python - Language features of Python, Data types, data structures, Control of flow, functions, modules, packaging, file handling, data/time operations,",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 71
  },
  {
    "chunk_id": "0110",
    "text": "classes, Exception handling Python packages - JSON, XML, HTTPLib, URLLib, SMTPLib. IoT Physical Devices and Endpoints - Introduction to Raspberry PI-Interfaces (serial, SPI, I2C) 10 IV Programming – Python program with Raspberry PI with focus of interfacing external gadgets, controlling output, reading input from pins. IoT Physical Servers and Cloud Offerings – Introduction to Cloud Storage models and communication APIs Webserver – Web server for IoT, Cloud for IoT, Python web application framework Designing a RESTful web API 9 TEXT BOOKS: Internet of Things - A Hands-on Approach, Arshdeep Bahga and Vijay Madisetti, Universities Press, 2015, ISBN: 9788173719547 Getting Started with Raspberry Pi, Matt Richardson & Shawn Wallace, O'Reilly (SPD), 2014, ISBN: 9789350239759",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 71
  },
  {
    "chunk_id": "0111",
    "text": "71 CSPE-712-A: Data Visualization Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section- E will cover whole syllabus. UNIT CONTENT No. of Hrs. I Foundations of Data Visualization Importance and Scope of Data Visualization: Understanding the role of data visualization in decision-making and data interpretation. History and Evolution of Visual Data Representation: Explore how visualization practices have evolved from statistical graphics to modern dashboards. Principles of Visual Perception: Gestalt Theory, Preattentive Attributes: Learn how humans perceive visual data and use it for effective design. Graphical Integrity Rules and Misleading Visuals: Discuss common distortions in charts and best practices to ensure accurate representation. Data Types: Categorical, Ordinal, Quantitative: Categorize different data types and their implications for visualization techniques. Types of Visualization: Static vs. Interactive, Exploratory vs. Explanatory: Contrast between different purposes and interaction levels of visualizations. Tools Overview: Introduction to tools like Excel, Tableau, Power BI, Matplotlib, Seaborn, and ggplot2. 10 II Visualization Techniques and Design Visual Encoding and",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 72
  },
  {
    "chunk_id": "0112",
    "text": "Design Concepts: Marks and Channels: Understand visual elements and channels (color, size, shape) for encoding data meaningfully. Chart Types: Learn to choose and apply 1D (bar, pie), 2D (scatter, heatmap), and multivariate chart types. Dashboards and Infographics: Best Practices: Principles of assembling multiple charts into coherent visual narratives or dashboards. Data-Ink Ratio and Edward Tufte Principles: Minimize visual clutter using Tufte’s classic data visualization design rules. Color Theory, Layout, Labeling and Accessibility: Apply design fundamentals to improve readability, color contrast, and user accessibility. Case Study: Redesigning a Poor Dashboard: Critically evaluate and improve an ineffective dashboard using best practices. 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 72
  },
  {
    "chunk_id": "0113",
    "text": "72 III Data Visualization using Python Introduction to Matplotlib and Seaborn: Learn to build high-quality static plots using Python visualization libraries. Creating Basic and Compound Charts: Combine multiple charts and elements (line, bar, scatter) to convey complex insights. Plot Customization: Axes, Legends, Grids, Subplots: Enhance readability and control chart aesthetics using plot configuration tools. Interactive Visualization using Plotly and Dash: Build dynamic and user- interactive dashboards for web or business applications. Handling Real-World Datasets: Work with CSV, Excel, APIs and databases to load and process data for visualization. Exploratory Data Analysis (EDA): Perform visual correlation, distribution, and pattern analysis through EDA. Project: Creating an Interactive COVID-19 Dashboard: Apply all concepts to build a real-world dashboard visualizing pandemic trends. 10 IV Advanced and Emerging Visualization Topics Geographic Visualization using Folium / GeoPandas: Map-based visualization techniques for spatial data using open-source tools. 3D Visualization and Animation Techniques: Explore dynamic and three- dimensional data representations for enhanced engagement. Storytelling with Data: Learn how to weave narrative into data insights for better communication. Ethics in Visualization: Understand ethical risks including bias, data manipulation, and privacy in visuals. VR/AR and Immersive Analytics (Intro): Introduction to emerging 3D, virtual reality, and immersive techniques in data viz. Visualizing Big Data with D3.js and Apache Superset: Overview of web- based and big-data scalable visualization tools and frameworks. Case Study: Business Decision Making using Visualization: Analyze how visuals influence critical decisions in business environments. 9 Textbooks: 1. Ben Fry, Visualizing Data: Exploring and Explaining Data with the Processing Environment, O'Reilly Media 2. Nathan Yau, Data Points: Visualization That Means Something, Wiley Reference books: 1. Edward R. Tufte, The Visual Display of Quantitative Information 2. Alberto Cairo, The Truthful Art: Data, Charts, and Maps for Communication 3. Claus O. Wilke, Fundamentals of Data Visualization, O’Reilly 4. Cole Nussbaumer Knaflic, Storytelling",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 73
  },
  {
    "chunk_id": "0114",
    "text": "with Data, Wiley 5. Tamara Munzner, Visualization Analysis and Design, CRC Press Course Outcomes: 1. Understand the core principles of visual perception and data integrity. 2. Select appropriate visualization techniques for different data types. 3. Design effective visualizations using modern tools and libraries.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 73
  },
  {
    "chunk_id": "0115",
    "text": "73 4. Apply Python to create interactive and informative visual dashboards. 5. Analyze and communicate data stories for real-world decision making. 6. Explore ethical and emerging aspects of data visualization, including VR and big data.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 74
  },
  {
    "chunk_id": "0116",
    "text": "74 CSPE-712-B: Optimization Techniques in ML Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. UNIT CONTENT No. of Hrs. I Fundamentals of Optimization: Introduction to Optimization in ML Context: Understand the role of optimization in training machine learning and deep learning models. Formulating Optimization Problems: Define objective functions, constraints, and decision variables in mathematical form. Convex vs. Non-Convex Optimization: Analyze problem types based on convexity and their impact on solution feasibility. Gradient Descent and its Variants: Study basic gradient descent, stochastic gradient descent (SGD), and mini-batch methods. Convergence and Step-Size (Learning Rate) Strategies: Explore step-size tuning, learning rate schedules, and stopping criteria. Challenges: Saddle Points, Vanishing/Exploding Gradients: Identify optimization hurdles in high-dimensional and deep networks. 10 II Classical Optimization Techniques Unconstrained Optimization: Explore analytical and numerical approaches for unconstrained minimization problems. Constrained Optimization using Lagrange Multipliers: Solve problems with equality/inequality constraints using KKT and Lagrangian methods. Linear and Quadratic Programming: Understand formulation and",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 75
  },
  {
    "chunk_id": "0117",
    "text": "solution of LP/QP in machine learning scenarios. Newton’s Method and Quasi-Newton Methods (BFGS, L-BFGS): Utilize second-order methods for faster convergence in smooth problems. Penalty and Barrier Methods: Study techniques to handle constraints indirectly 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 75
  },
  {
    "chunk_id": "0118",
    "text": "75 within objective functions. Applications in Support Vector Machines and Logistic Regression: Apply optimization theory in model fitting and dual formulations. III Stochastic and Heuristic Optimization Momentum, Nesterov Accelerated Gradient (NAG): Improve convergence by introducing momentum-based optimizers. Adaptive Methods: Adagrad, RMSProp, Adam, Nadam: Study adaptive learning-rate methods widely used in deep learning. Hyperparameter Optimization Techniques: Explore Grid Search, Random Search, and Bayesian Optimization for tuning. Evolutionary Algorithms (GA, DE): Understand nature-inspired population- based optimization strategies. Simulated Annealing and Particle Swarm Optimization: Heuristic global optimization techniques suitable for non-differentiable problems. Applications in Hyperparameter Tuning and Neural Architecture Search: Implement heuristics for exploring optimal ML configurations. 10 IV Optimization in Deep Learning and Emerging Trends Optimization Challenges in Deep Networks: Discuss issues like overfitting, gradient vanishing, and landscape complexity. Batch Normalization and Dropout: Study how these techniques impact convergence and generalization. Optimization in Reinforcement Learning: Understand policy gradients and reward maximization strategies. Distributed and Parallel Optimization: Strategies to optimize ML models across GPUs or distributed clusters. Meta-Learning and Few-shot Optimization: Explore learning-to-learn strategies using optimization as a meta-level task. Recent Advances: Transformers, Attention, Diffusion-based Optimization: Overview of cutting-edge models and their training optimization techniques. Case Study: Optimization Workflow in Large-Scale Deep Learning Projects: A practical walk-through of optimization strategy in real-world ML pipelines. 9 Textbooks: 1. D. P. Bertsekas, Nonlinear Programming, Athena Scientific 2. S. Boyd and L. Vandenberghe, Convex Optimization, Cambridge University Press Reference books: 1. Ian Goodfellow, Yoshua Bengio, Aaron Courville – Deep Learning, MIT Press 2. Rajiv Chopra – Operations Research, Narosa Publishing 3. Sebastian Raschka – Python Machine Learning, Packt 4. Kevin P. Murphy – Probabilistic Machine Learning, MIT Press",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 76
  },
  {
    "chunk_id": "0119",
    "text": "76 Course Outcomes: By the end of this course, students will be able to: 1. Understand foundational principles of optimization in the context of machine learning. 2. Apply classical and numerical optimization techniques to machine learning problems. 3. Employ stochastic and adaptive optimizers in neural network training. 4. Design optimization strategies for constrained and unconstrained learning tasks. 5. Utilize heuristic methods for hyperparameter tuning and architecture search. 6. Explore advanced optimization methods for deep learning, reinforcement learning, and meta-learning.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 77
  },
  {
    "chunk_id": "0120",
    "text": "77 CSPE-712-C: Full Stack Development with AI Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. To learn the core concepts of both the frontend and backend programming course. 2. To get familiar with the latest web development technologies. 3. To learn all about databases. 4. To learn complete web development process. 5. To provide an in-depth study of the various web development tools. Course Outcomes: 1. Develop a fully functioning website and deploy on a web server. 2. Gain Knowledge about the front end and back-end Tools. 3. Find and use code packages based on their documentation to produce working results in a project. 4. Create web pages that function using external data. UNIT CONTENT No. of Hrs. I Web Development Basics: Web development Basics - HTML & Web servers Shell - UNIX CLI Version control - Git & GitHub HTML, CSS Frontend Development: JavaScript basics OOPS Aspects of JavaScript Memory usage and Functions in JS AJAX for data exchange with server jQuery Framework jQuery events, UI components etc. JSON data format. 10 II REACT JS: Introduction to React Router and Single Page Applications React Forms, Flow Architecture and Introduction to Redux More Redux and Client-Server Communication. 10 III Java Web Development: JAVA PROGRAMMING BASICS, Model View Controller (MVC) Pattern MVC Architecture using Spring RESTful API using Spring Framework Building an application using Maven. 10 IV Databases & Deployment: Relational schemas and normalization Structured Query Language (SQL) Data persistence using Spring JDBC Agile development principles and deploying application in Cloud 9 Text Books: 1. Web Design with HTML, CSS, JavaScript and JQuery Set Book by Jon",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 78
  },
  {
    "chunk_id": "0121",
    "text": "Duckett Professional JavaScript for Web Developers Book by Nicholas C. Zakas. 2. Learning PHP, MySQL, JavaScript, CSS & HTML5: A Step-by-Step Guide to Creating Dynamic Websites by Robin Nixon.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 78
  },
  {
    "chunk_id": "0122",
    "text": "78 3. Full Stack JavaScript: Learn Backbone.js, Node.js and MongoDB. Copyright © 2015 azat mardan Reference Books: 1. Full-Stack JavaScript Development by Eric Bush. 2. Mastering Full Stack React Web Development Paperback – April 28, 2017 Tomasz Dyl , Kamil Przeorski, Maciej Czarnecki.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 79
  },
  {
    "chunk_id": "0123",
    "text": "79 CSPE-712-D: Quantum Computing Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. To provide an introduction and necessary expertise to the learner in the upcoming discipline of Quantum Computing and Machine Learning. 2. To enable the students to learn Quantum Computing and Quantum Machine Learning in practical- oriented learning sessions so that he/she can independently use existing open- source Quantum Computing Hardware and Software Frameworks 3. To teach the students to develop hybrid solutions by applying Quantum Machine Learning to potential business application areas. 4. To study Quantum Information Theory and Quantum Computing Programming Model of Computation. 5. To study Quantum Algorithms and apply these to develop hybrid solutions. 6. To study Quantum Concepts necessary for understanding the Quantum Computing Paradigm and compare the available hardware and software infrastructure and frameworks made available open source by major players in the Industry and Academia Course Outcomes: On completion of the course, students will be able to– CO1: Comprehend the concepts of Quantum Computing CO2: Apprehend the mathematical foundation and quantum mechanics CO3: Implement the building blocks of Quantum circuits CO4: Comprehend the quantum information, its processing and Simulation tools CO5: Understand basic signal processing algorithms FT, DFT and FFT CO6: Solve examples of Quantum Fourier Transforms and their applications UNIT CONTENT No. of Hrs. I Introduction to Quantum Computing Fundamental Concepts of Quantum computing: Introduction and Overview, Global Perspective, Quantum Bits, Quantum Computation, Quantum Algorithms, Quantum Information and Quantum information processing, Comparison between classical and quantum computing, Quantum Computing Systems & Architecture, Quantum computing Application. Mathematical Foundation of Quantum Computing Quantum Computations: Quantum circuits, Quantum algorithms and",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 80
  },
  {
    "chunk_id": "0124",
    "text": "qubit operations, Controlled operations, Principal deferred and Principal implicit Measurements, Universal Quantum Gates, Two level unitary gates, single qubit and CNO, discrete set of universal operations, Quantum computational 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 80
  },
  {
    "chunk_id": "0125",
    "text": "80 complexity, Postulates of Quantum Mechanics. II Quantum Simulation Algorithms and Fourier Transform Simulation of Quantum Systems, Simulation in action, exponential complexity growth of quantum systems, Quantum simulation algorithm, examples of quantum simulations, perspectives of quantum simulation, Understanding Basics of Fourier transform, Discrete Fourier Transform, Fast Fourier Transform, Definitions, mathematical representations of Fourier Transform, discrete Fourier transform (DFT) and fast Fourier transform (FFT), Quantum Fourier Transform Shore’s Factorization Algorithm 10 III Quantum Simulation Algorithms and Fourier Transform Simulation of Quantum Systems, Simulation in action, exponential complexity growth of quantum systems, Quantum simulation algorithm, examples of quantum simulations, perspectives of quantum simulation, Understanding Basics of Fourier transform, Discrete Fourier Transform, Fast Fourier Transform, Definitions, mathematical representations of Fourier Transform, discrete Fourier transform (DFT) and fast Fourier transform (FFT), Quantum Fourier Transform Shore’s Factorization Algorithm Quantum Fourier Transform and Applications Quantum Fourier Transform, Phase estimation performance and requirements, order finding application, factoring application, General applications of Quantum Fourier transform, period finding, discrete algorithms, and Other Quantum Algorithms. 10 IV Quantum Machine Learning Quantum Machine Learning and Quantum AI, Quantum Neural Networks, Quantum Natural Language Understanding, Quantum Cryptography, Application Domains for Quantum Machine Learning: Chemistry/Material Science, Space Tech, Finance related Optimization Problems, Swarm Robotics, Cyber security. 9 Text Books: 1. Michael A. Nielsen, “Quantum Computation and Quantum Information”, Cambridge University 2. Wittek, “Quantum Machine Learning next-generation Computing Means to Data Mining”, Peter University of Boras, Sweden - Elsevier Publications 3. Andreas Winchert, “Principles of Quantum Artificial Intelligence”, Instituto Superior Técnico - Universidade de Lisboa, Portugal - World Scientific Publishing, Bstoragerary Cataloguing-in- Publication Data Reference Books: 1. Press Stephen Kan, “Metrics and standards Software Quality Engineering, Pearson, ISBN- 10:0133988082; ISBN-13:978-0133988086 2. Michael A. Nielsen, “Quantum Computation and Quantum Information”, Cambridge University PressStephen Kan, ―Metrics and Models in Software Quality Engineering‖, Pearson, ISBN-10: 0133988082; ISBN-13:",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 81
  },
  {
    "chunk_id": "0126",
    "text": "978-0133988086",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 81
  },
  {
    "chunk_id": "0127",
    "text": "81 3. David McMahon, “Quantum Computing Explained”, Wiley 4. Microsoft Quantum Development Kithttps://www.microsoft.com/enus/quantum/development-kit Forest SDK PyQuil: https://pyquil.readthedocs.io/en/stable/ 5. Amazon Bracket Documentation on AWS:https://aws.amazon.com/braket/ 7 D-Wave Systems Documentation: https://docs.dwavesys.com/docs/latest/index.html. E Books / E Learning References: 1. http://mmrc.amss.cas.cn/tlb/201702/W020170224608149940643.pdf 2. http://mmrc.amss.cas.cn/tlb/201702/W020170224608150244118.pdf MOOC Courses Links: 1. https://onlinecourses.nptel.ac.in/noc21_cs103/preview 2. https://www.coursera.org/learn/introduction-to-quantum-information",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 82
  },
  {
    "chunk_id": "0128",
    "text": "82 CSPE-712-E: UNIX / Linux Operating System Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: This course introduces various tools and techniques commonly used by Linux programmers, system administrators and end users to achieve their day to day work in Linux environment. It is designed for computer students who have limited or no previous exposure to Linux. Course Outcomes: On completion of the course, students will be able to– CO1: Have a good working knowledge of Linux, from both a graphical and command line perspective, allowing them to easily use any Linux distribution. CO2: This course shall help students to learn advanced subjects in computer science practically. CO3: Students shall be able to progress as a Developer or Linux System Administrator using the acquired skill set. UNIT CONTENT No. of Hrs. I Introduction: History of Linux, Philosophy, Community, Terminology, Distributions, Linux kernel vs distribution. Why learn Linux? Importance of Linux in software ecosystem: web servers, supercomputers, mobile, servers. Installation: Installation methods, Hands on Installation using CD/DVD or USB drive. Linux Structure: Linux Architecture, Filesystem basics, the boot process, init scripts, runlevels, shutdown process, very basic introductions to Linux processes, Packaging methods: rpm/deb, Graphical Vs Command line. 10 II Graphical Desktop: Session Management, Basic Desktop Operations, Network Management, Installing and Updating Software, Text editors: gedit, vi, vim, emacs, Graphics editors, Multimedia applications. Command Line: Command line mode options, Shells, Basic Commands, General Purpose Utilities, Installing Software, User management, Environment variables, Command aliases. Linux Documentation: man pages, GNU info, help command, More documentation sources File Operations: Filesystem, Filesystem architecture, File types, File attributes, Working with files, Backup, compression. 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 83
  },
  {
    "chunk_id": "0129",
    "text": "83 III Security: Understanding Linux Security, Uses of root, sudo command, working with passwords, Bypassing user authentication, 15L Understanding ssh Networking: Basic introduction to Networking, Network protocols: http, ftp etc., IP address, DNS, Browsers, Transferring files. ssh, telnet, ping, traceroute, route, hostname, networking GUI. 10 IV Basic Shell Scripting: Features and capabilities, Syntax, Constructs, modifying files, Sed, awk command, File manipulation utilities, Dealing with large files and Text, String manipulation, Boolean expressions, File tests, Case, Debugging, Regular expressions 9 Text Books: 1. Unix Concepts and Applications by Sumitabha Das. 2. Official Ubuntu Book, 8th Edition, by Matthew Helmke & Elizabeth K. Joseph with Jose Antonio Rey and Philips Ballew, Prentice Hall Reference Books: 1. Linux kernel Home: http://kernel.org 2. Open Source Initiative: https://opensource.org/ 3. The Linux Foundation: http://www.linuxfoundation.org/",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 84
  },
  {
    "chunk_id": "0130",
    "text": "84 CSPE-712-F: AD-HOC & WIRELESS SENSOR NETWORKS Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. To understand the concepts of sensor networks 2. To understand the MAC and transport protocols for ad hoc networks 3. To understand the security of sensor networks 4. To understand the applications of adhoc and sensor networks Course Outcomes: On completion of the course, students will be able to– 1. Ability to understand the state-of-the-art research in the emerging subject of Ad Hoc and Wireless Sensor Networks 2. Ability to solve the issues in real-time application development based on ASN. 3. Ability to conduct further research in the domain of ASN UNIT CONTENT No. of Hrs. I Introduction to Ad Hoc Networks - Characteristics of MANETs, Applications of MANETs and Challenges of MANETs. Routing in MANETs - Criteria for classification, Taxonomy of MANET routing algorithms, Topology based routing algorithms-Proactive: DSDV; Reactive: DSR, AODV; Hybrid: ZRP; Position-based routing algorithms- Location Services-DREAM, Quorum-based; Forwarding Strategies: Greedy Packet, Restricted Directional Flooding-DREAM, LAR. 10 II Data Transmission - Broadcast Storm Problem, Rebroadcasting Schemes- Simple-flooding, Probability-based Methods, Area-based Methods, Neighbor Knowledge-based: SBA, Multipoint Relaying, AHBP. Multicasting: Tree- based: AMRIS, MAODV; Mesh-based: ODMRP, CAMP; Hybrid: AMRoute, MCEDAR. 10 III Geocasting: Data-transmission Oriented-LBM; Route Creation Oriented- GeoTORA, MGR. TCP over Ad Hoc TCP protocol overview, TCP and MANETs, Solutions for TCP over Ad hoc Basics of Wireless, Sensors and Lower Layer Issues: Applications, Classification of sensor networks, Architecture of sensor network, Physical layer, MAC layer, Link layer, Routing Layer. 10 IV Upper Layer Issues of WSN: Transport layer, High-level application layer support, Adapting to the inherent dynamic nature",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 85
  },
  {
    "chunk_id": "0131",
    "text": "of WSNs, Sensor Networks and mobile robots. 9",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 85
  },
  {
    "chunk_id": "0132",
    "text": "85 TEXT BOOKS: 1. Ad Hoc and Sensor Networks – Theory and Applications, Carlos Corderio Dharma P. Aggarwal, World Scientific Publications, March 2006, ISBN – 981–256–681–3. 2. Wireless Sensor Networks: An Information Processing Approach, Feng Zhao, Leonidas Guibas, Elsevier Science, ISBN – 978-1-55860-914-3 (Morgan Kauffman).",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 86
  },
  {
    "chunk_id": "0133",
    "text": "86 CSPE-713-A: Big Data Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. To introduce students to basic concepts, terms, applications of big data 2. To apprehend Advanced Analytical Methods in Data Science 3. To acquaint with the tools like Hadoop, NoSQL, MapReduce which are required to manage and analyze big data 4. To program various issues related to Industry standards using Big Data Analytics 5. To visualize Big Data using different tools Course Outcomes: After completion of the course, learners should be able to- CO1: Apply the techniques to handle missing data for real world applications. CO2: Exemplify Analytical Methods like Clustering and Association Rule for Big Data Analytics CO3: Use the novel architectures and platforms introduced for Big data, in particular Hadoop & Map Reduce CO4: Differentiate the advanced predictive analytics algorithms in various applications like Retail, Finance, Healthcare CO5: Evaluate needs, challenges, and techniques for big data visualization CO6: Design various applications and simulate the analytics tools UNIT CONTENT No. of Hrs. I Unit Introduction to Big Data and Analytics Introduction to Big Data: Characteristics – Evolution – Definition - Challenges with Big Data, Traditional Business Intelligence versus Big Data. State of Practice in Analytics, Key roles for New Big Data Ecosystems. Big Data Analytics: Introduction & importance of Analytics, Classification of Analytics – Challenges- Big Data Analytics, Big Data Technologies (Apache Hadoop, Rapid miner, Looker), Soft state eventual consistency. Basic Data Analytic Methods, Need of Big Data Analytics Advanced Analytical Theory and Methods: Clustering- Overview, K means- Use cases, Overview of methods, determining number of clusters, diagnostics, reasons to choose and cautions. Association",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 87
  },
  {
    "chunk_id": "0134",
    "text": "Rules- Overview, a-priori algorithm, evaluation of candidate rules, case study- transactions in grocery store, validation and testing, diagnostics. Regression- linear, logistics, reasons to choose and cautions, additional regression models 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 87
  },
  {
    "chunk_id": "0135",
    "text": "87 II Predictive Analysis Process and R Introduction to R: R graphical User Interfaces, Data import and Export, Dirty Data, Data Analysis, Linear regression with R, clustering with R hypothesis testing, Data cleaning and validation tools: MapReduce Data Analytics Lifecycle: Discovery, Data Preparation, Model Planning, Model Building, communicate results, Operationalize, Building a Predictive model. Advanced Predictive Analytics Algorithms and Python Introduction of Exploratory Data Analytics (EDA) -Definition, Motivation, Steps in data exploration, data types. Techniques to Improve Classification Accuracy: Introducing Ensemble Methods, Bagging, Boosting and AdaBoost, Random Forest. Model Evaluation and Selection - Confusion Matrix, Dataset Partitioning Methods-Holdout Method and Random Subsampling, Cross Validation. 10 III Big Data Visualization Introduction to Data Visualization: Objective and challenges to Big data visualization, Conventional data visualization tools, techniques for visual data representation, types of data visualization, Tools used in data visualization, Open – source data visualization tools, Analytical techniques used in Big data visualization, Data Visualization using Tableau Introduction to: Candela, D3.js, Google Chart API 10 IV Big Data Analytics Applications and Tools Big Data Analytics Applications: Retail Analytics, Financial Data Analytics, Healthcare Analytics, Supply chain management Types of Big Data Analytics tools: Data Collection Tools-Semantria tool, AS Sentiment Analysis tool, Data Storage tools and frameworks: Apache HBase, CouchDB, Data filtering and extraction tool: Scraper, Mozenda, Comparison of Various Tools 9 Text Books: 1. Wiley CIO, Michael Minelli, Michele Chambers, Ambiga Dhiraj, John Wiley & Sons, “Big Data, Big Analytics: Emerging Business Intelligence and Analytic Trends for Today's Businesses”, 2012 2. EMC Education Services, “Data Science and Big Data Analytics-Discovering, analyzing Visualizing and Presenting Data”, 1st edition 3. Han, Jiawei Kamber, Micheline Pei and Jian, “Data Mining: Concepts and Techniques”, Elsevier Publishers, ISBN:9780123814791, 9780123814807 Reference Books: 1. Manovich, Lev., “Trending: The Promises and the Challenges of Big Social Data. Debates in the Digital",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 88
  },
  {
    "chunk_id": "0136",
    "text": "Humanities”, The University of Minnesota Press, 2012 2. Raj, Pethuru, “Handbook of Research on Cloud Infrastructures for Big Data Analytics”, IGI Global, 2014 3. Wajid Khattak, Paul Buhler, Thomas Erl, “Big Data Fundamentals: Concepts, Drivers & Techniques”, John Wiley & Sons, ISBN: 13: 9780134291079",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 88
  },
  {
    "chunk_id": "0137",
    "text": "88 E Books / E Learning References: 1. https://files.eric.ed.gov/fulltext/ED536788.pdf 2. https://www.iare.ac.in/sites/default/files/NEW%20LECHURE%20NOTES.pdf 3. https://mrcet.com/downloads/digital_notes/CSE/IV%20Year/(R17A0528%20)%20Big%2 0D ata%20Analytics%20Digital%20notes.pdf 4. https://content.e-bookshelf.de/media/reading/L-11307411-11b3dd5f67.pdf MOOC Courses Links: 1. Big Data Computing: https://onlinecourses.nptel.ac.in/noc20_cs92/preview 2. Applied Optimization For Wireless, Machine Learning, Big Data: https://onlinecourses.nptel.ac.in/noc23_ee99/preview 3. Big Data Computing by NPTEL: https://www.shiksha.com/online-courses/big-data- computing- by-nptel-course-nptel33",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 89
  },
  {
    "chunk_id": "0138",
    "text": "89 CSPE-713-B: Advanced Machine Learning Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Instructions to the question paper setter: Question paper of end semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of 12 marks each and section E has short answer type questions consisting of six parts of 02 marks each. The candidate will attempt five questions in all, i.e one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Unit-I: Advanced Supervised Learning Techniques ● Review of ML Fundamentals Quick recap of supervised, unsupervised, and basic model training workflows. ● Support Vector Machines and Kernel Methods Non-linear decision boundaries using kernel tricks and margin optimization. ● Ensemble Learning: Bagging, Boosting, Stacking Improve predictive performance through model aggregation techniques. ● Gradient Boosting, XGBoost, LightGBM, CatBoost Implementation and tuning of modern boosting libraries. ● Model Evaluation and Error Analysis ROC, AUC, F1-Score, precision-recall curves and confusion matrix deep dive. ● Case Study: Model Selection for a Classification Pipeline Practical implementation comparing performance of advanced classifiers. Unit-II: Unsupervised and Semi-Supervised Learning ● Dimensionality Reduction Techniques PCA, t-SNE, UMAP for visualizing and reducing high-dimensional datasets. ● Clustering Algorithms K-Means, DBSCAN, Agglomerative and Spectral Clustering. ● Gaussian Mixture Models and Expectation-Maximization Probabilistic clustering with soft assignments using EM algorithm. ● Autoencoders and Representation Learning",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 90
  },
  {
    "chunk_id": "0139",
    "text": "Learn compressed feature representations using neural architectures. ● Semi-Supervised Learning Approaches Techniques for training models with limited labeled data. ● Case Study: Customer Segmentation and Pattern Discovery Applying clustering and dimensionality reduction on business datasets. Unit-III: Probabilistic and Generative Models",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 90
  },
  {
    "chunk_id": "0140",
    "text": "90 ● Bayesian Learning and Inference Prior, likelihood, and posterior-based modeling for uncertainty quantification. ● Naive Bayes and Bayesian Networks Classification using probabilistic graphical models. ● Markov Models and Hidden Markov Models (HMMs) Sequence modeling with observable and hidden states. ● Generative Adversarial Networks (GANs) Learn to generate synthetic data with adversarial training. ● Variational Autoencoders (VAEs) Probabilistic latent variable models using encoder-decoder networks. ● Case Study: Image Generation and Sequence Labeling Tasks End-to-end modeling using GANs and HMMs. Unit-IV: Recent Trends and Applications in ML ● Introduction to Deep Reinforcement Learning Explore agents, environments, rewards and policy/value-based methods. ● Attention Mechanisms and Transformers (BERT, GPT) Study how self-attention revolutionized sequence learning tasks. ● ML Ops and Model Deployment Integrate machine learning with DevOps for scalable deployment. ● Explainable AI (XAI) Understand model interpretability using SHAP, LIME and CAM. ● Ethics, Fairness and Bias in Machine Learning Address issues of discrimination, transparency and accountability. ● Case Study: Responsible AI Implementation in Healthcare/Finance Understand how real-world applications integrate ethical ML practices. Textbooks: 1. Kevin P. Murphy, Machine Learning: A Probabilistic Perspective, MIT Press 2. Ian Goodfellow, Deep Learning, MIT Press Reference books: 1. Aurélien Géron – Hands-On Machine Learning with Scikit-Learn, Keras & TensorFlow, O’Reilly 2. Trevor Hastie, Robert Tibshirani, Jerome Friedman – The Elements of Statistical Learning 3. Bishop C. M. – Pattern Recognition and Machine Learning, Springer 4. Francois Chollet – Deep Learning with Python, Manning Publications 5. Tom M. Mitchell – Machine Learning, McGraw Hill Course Outcomes: By the end of this course, students will be able to: 1. Understand and implement advanced supervised learning algorithms including ensemble methods. 2. Apply unsupervised and semi-supervised methods for data exploration and clustering. 3. Develop and evaluate generative and probabilistic models for classification and generation tasks. 4. Integrate attention and deep",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 91
  },
  {
    "chunk_id": "0141",
    "text": "reinforcement learning models into practical applications. 5. Deploy machine learning models using MLOps and ensure ethical AI practices. 6. Analyze real-world ML use cases through end-to-end project-based learning.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 91
  },
  {
    "chunk_id": "0142",
    "text": "91 CSPE-713-C: Blockchain Technology Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. Technology behind Blockchain 2. Crypto currency, Bitcoin and Smart contracts 3. Different consensus algorithms used in Blockchain 4. Real-world applications of Blockchain 5. To analyze Blockchain Ethereum Platform using Solidity 6. To Describe Blockchain Case Studies Course Outcomes: On completion of the course, student will be able to– CO1: Interpret the fundamentals and basic concepts in Blockchain CO2: Compare the working of different blockchain platforms CO3: Use Crypto wallet for cryptocurrency-based transactions CO4: Analyze the importance of blockchain in finding the solution to the real-world problems. CO5: Illustrate the Ethereum public block chain platform CO6: Identify relative applications where block chain technology can be effectively used and implemented. UNIT CONTENT No. of Hrs. I Mathematical Foundation for Blockchain Cryptography: Symmetric Key Cryptography and Asymmetric Key Cryptography, Elliptic Curve Cryptography (ECC), Cryptographic Hash Functions: SHA256, Digital Signature Algorithm (DSA), Merkel Trees. Feature Engineering History, Centralized Vs. Decentralized Systems, Layers of Blockchain: Application Layer, Execution Layer, Semantic Layer, Propagation Layer, Consensus Layer, Why is Block chain important? Limitations of Centralized Systems, Blockchain Adoption So Far. 10 II Blockchain Platforms and Consensus in Blockchain Types of Blockchain Platforms: Public, Private and Consortium, Bitcoin, Ethereum, Hyperledger, IoTA, Corda, R3. Consensus in Blockchain: Consensus Approach, Consensus Elements, Co nsensus Algorithms, Proof of Work, Byzantine General problem, Proof of Stake, Proof of Elapsed Time, Proof of Activity, Proof of Burn 10 III Cryptocurrency – Bitcoin, and Token Introduction, Bitcoin and the Cryptocurrency, Cryptocurrency Basics, Types of Cryptocurrency, Cryptocurrency Usage, Cryptowallets: Metamask, Coinbase, Binance Blockchain Ethereum Platform using Solidity What is",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 92
  },
  {
    "chunk_id": "0143",
    "text": "Ethereum, Types of Ethereum Networks, EVM (Ethereum Virtual 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 92
  },
  {
    "chunk_id": "0144",
    "text": "92 Machine), Introduction to smart contracts, Purpose and types of Smart Contracts, Implementing and deploying smart contracts using Solidity, Swarm (Decentralized Storage Platform), Whisper (Decentralized Messaging Platform) IV Blockchain Case Studies Prominent Blockchain Applications, Retail, Banking and Financial Services, Government Sector, Healthcare, IOT, Energy and Utilities, Blockchain Integration with other Domains 9 Text Books: 1. Martin Quest, Blockchain Dynamics: A Quick Beginner's Guide on Understanding the Foundations of Bit coin and Other Crypto currencies‖, Create Space Independent PublishingPlatform, 15-May-2018 2. Imran Bashir, ―Mastering Blockchain: Distributed Ledger Technology, Decentralization and Smart Contracts Explained‖, Second Edition, Packt Publishing, 2018 3. Alex Leverington, ―Ethereum Programming‖, Packt Publishing, 2017 Reference Books: 1. Bikramaditya Singhal, Gautam Dhameja, Priyansu Sekhar Panda, \"Beginning Blockchain: A Beginner‘s Guide to Building Blockchain Solutions\",2018 2. Chris Dannen, \"Introducing Ethereum and Solidity\", Foundations of Crypto currency and Blockchain Programming for Beginners 3. Daniel Drescher, \"Blockchain Basics\", A Non -Technical Introduction in 25Steps. E Books / E Learning References: 1. https://users.cs.fiu.edu/~prabakar/cen5079/Common/textbooks/Mastering_Blockchain_2 nd_ Edition.pdf 2. https://www.lopp.net/pdf/princeton_bitcoin_book.pdf 3. https://www.blockchainexpert.uk/book/blockchain-book.pdf MOOC Courses Links: 1. NPTEL Course on ―Introduction to Blockchain Technology & Application https://nptel.ac.in/courses/106/104/106104220/ 2. NPTEL Course on https://nptel.ac.in/courses/106/105/106105184/",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 93
  },
  {
    "chunk_id": "0145",
    "text": "93 CSPE-713-D: DevOps Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: To understand the need of DevOps as a software engineering practice. 1. To understand the background of DevOps Evolution. 2. To know and understand the concept of Continuous Integration Continuous Delivery (CICD). 3. To learn the concept of continuous deployment and test strategies. 4. To learn the monitoring system and reliability engineering. 5. To explore the emerging tools used in the DevOps lifecycle. Course Outcomes: On completion of the course, students will be able – CO1. Understand the fundamental concepts of DevOps CO2. Link the background of DevOps with other technologies CO3. Comprehend the concept of continuous integration and continuous delivery CO4. Compare various stages of continuous deployment and test strategies CO5. Justify the importance of monitoring system and reliability engineering CO6. Use the latest tools in DevOps UNIT CONTENT No. of Hrs. I Introduction to DevOps and the Culture What is DevOps? Role of DevOps Engineer, Developer responsibility, Introduction to Continuous Integration and Continuous Delivery Policies, DevOps Culture: Dilution of barriers in IT departments, Process automation, Agile Practices, Reason for adopting DevOps, What and Who Are Involved in DevOps? Changing the Coordination, Introduction to DevOps pipeline phases, Defining the Development Pipeline, Centralizing the Building Server, Monitoring Best Practices. 10 II Microservices Architecture and Cloud Native Development Monolithic applications, Introduction to microservice architecture, Implementing a microservices Architecture, Pros and Cons of a microservice Architecture, Characteristics of microservice architecture, Monolithic applications and microservices compared, microservices best practices, Deployment strategies, Introduction to cloud computing, cloud computing deployment models, service models, why to use cloud, Principle of container based",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 94
  },
  {
    "chunk_id": "0146",
    "text": "application design, Introduction to Docker, Serverless computing, orchestration, Difference between orchestration and automation 10 III Continuous Integration and Test- Driven Development Introduction to continuous integration, time to market and quality, Build in a Continuous Integration Scenario, Code Repository Server, Continuous Integration Server, Introduction to Continuous Delivery and chain, Differentiate Continuous Integration and Continuous Delivery, Strategies for Continuous Delivery, Benefits 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 94
  },
  {
    "chunk_id": "0147",
    "text": "94 of Continuous Integration and Continuous Delivery, Designing a CI and CD System, Building Continuous Integration and Continuous Delivery Pipelines, Continuous Database Integration, Preparing the Build for Release, Identifying the Code in the Repository, Creating Build Reports, Putting the Build in a Shared Location, Releasing the Build Continuous Deployment and Orchestration Implementing a testing Strategy: Types of Tests, Integration testing, managing defect backlogs, what is Continuous Deployment? Changes moving through the deployment pipeline, Trade-offs in the deployment pipeline, Basic Deployment pipeline, Deployment pipeline practices & Commit stage, Automated Acceptance Test Gate, Subsequent test stages, preparing to release, Implementing a deployment pipeline IV Continuous Monitoring and Site Reliability What is a monitoring system? Factors involved in monitoring systems, why monitoring is important, white-box and black-box monitoring, building a monitoring system, monitoring infrastructure and applications, collecting data, logging, creating dashboard, behavior driven monitoring, what is site reliability engineering? SRE and DevOps, roles, and responsibilities of SRE, common tools used by SREs DevOps Tooling and Case Studies Continuous Development/ Version Control: Git, Serverless orchestration: Kubernetes, Container Technology: Docker, Continuous Integration: Jenkins, Continuous delivery: Jenkins, Continuous Deployment: Ansible, Continuous Testing: Selenium, Monitoring: Prometheus, Bug tracking tool: Jira, elk stack. Case study: Spotify: Using Docker, Bank of New Zealand, EtSy. 9 Text Books: 1. Pierluigi Riti, “Pro DevOps with Google Cloud Platform”, Apress, ISBN: 978-1-4842-3896-7. 2. Katrina Clokie, “A Practical Guide to Testing in DevOps”, Lean Publishing published on 2017-08- 01 3. Jez Humble and David Farley, “Continuous Delivery”, Pearson Education, Inc, ISBN: 978–0–321– 60191–9 Reference Books: 1. Viktor Farcic, “The DevOps 2.0 Toolkit: Automating the Continuous Deployment Pipe line with Containerized Microservices” 2. Jennifer Davis and Katherine Daniels, “Effective DevOps: Building a Culture of Collaboration, Anity, and Tooling at Scale”, O’Reilly Media, Inc., ISBN: 978-1-491-92630-7 3. Sanjeev Sharma and Bernie Coyne, “DevOps for Dummies”,",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 95
  },
  {
    "chunk_id": "0148",
    "text": "John Wiley & Sons, Inc., 2nd IBM Limited Edition, ISBN: 978-1-119-04705-6 E Books / E Learning References: 1. https://www.redhat.com/en/resources/cloud-native-container-design-whitepaper 2. https://www.redhat.com/en/topics/cloud-native-apps/what-is-serverless 3. https://www.redhat.com/en/topics/automation/what-is-orchestration 4. https://www.atlassian.com/continuous-delivery/continuous-integration 5. https://www.flagship.io/glossary/site-reliability-engineer/ 6. https://docs.microsoft.com/en-us/learn/paths/intro-to-vc-git/",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 95
  },
  {
    "chunk_id": "0149",
    "text": "95 CSPE-713-E: Cyber Forensics Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. A brief explanation of the objective is to provide digital evidence which is obtained from digital media. 2. In order to understand the objectives of computer forensics, first of all, people have to recognize the different roles computers play in a certain crime. 3. According to a snippet from the United States Security Service, the computer functions in different kinds of crimes. Course Outcomes: 1. Students will understand the usage of computers in forensic, and how to use various forensic tools for a wide variety of investigations. 2. It gives an opportunity to students to continue their zeal in research in computer forensics UNIT CONTENT No. of Hrs. I Introduction of Cybercrime: Types, The Internet spawns crime, Worms versus viruses, Computers' roles in crimes, Introduction to digital forensics, Introduction to Incident - Incident Response Methodology – Steps - Activities in Initial Response, Phase after detection of an incident Initial Response and forensic duplication, Initial Response & Volatile Data Collection from Windows system -Initial Response & Volatile Data Collection from Unix system – Forensic Duplication: Forensic duplication: Forensic Duplicates as Admissible Evidence, Forensic Duplication Tool Requirements, Creating a Forensic. Duplicate/Qualified Forensic Duplicate of a Hard Drive 10 II Forensics analysis and validation: Determining what data to collect and analyze, validating forensic data, addressing data-hiding techniques, performing remote acquisitions. Network Forensics: Network forensics overview, performing live acquisitions, developing standard procedures for network forensics, using network tools, examining the honeynet project 10 III Current Forensic tools: evaluating computer forensic tool needs, computer forensics software tools, computer forensics",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 96
  },
  {
    "chunk_id": "0150",
    "text": "hardware tools, validating and testing forensics software E-Mail Investigations: Exploring the role of e-mail in investigation, exploring the roles of the client and server in e-mail, investigating e- mail crimes and violations, understanding e-mail servers, using specialized e-mail forensic tools. Cell phone and mobile device forensics: Understanding mobile device forensics, understanding acquisition procedures for cell phones and mobile devices. 10",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 96
  },
  {
    "chunk_id": "0151",
    "text": "96 IV Working with Windows and DOS Systems: understanding file systems, exploring Microsoft File Structures, Examining NTFS disks, Understanding whole disk encryption, windows registry, Microsoft startup tasks, MS-DOS startup tasks, virtual machines. 9 Text Books: 1. Kevin Mandia, Chris Prosise, “Incident Response and computer forensics”, Tata McGraw Hill, 2006. 2. Computer Forensics, Computer Crime Investigation by John R. Vacca, Firewall Media, New Delhi. 3. Computer Forensics and Investigations by Nelson, Phillips Enfinger, Steuart, CENGAGE Learning Reference Books: 1. Real Digital Forensics by Keith J. Jones, Richard Bejtiich, Curtis W. Rose, Addison- Wesley Pearson Education 2. Forensic Compiling, A Tractitioneris Guide by Tony Sammes and Brian Jenkinson, Springer International edition.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 97
  },
  {
    "chunk_id": "0152",
    "text": "97 CSPE-713-F: SOFT COMPUTING Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks: 40 Maximum Marks: 60 100 3 Hours Minimum Marks: 16 Minimum Marks: 24 40 Course Objectives: 1. Familiarize with soft computing concepts 2. Introduce and use the idea of fuzzy logic and use of heuristics based on human experience 3. Familiarize the Neuro-Fuzzy modeling using Classification and Clustering techniques 4. Learn the concepts of Genetic algorithm and its applications 5. Acquire the knowledge of Rough Sets. Course Outcomes: On completion of this course, the students will be able to: 1. Identify the difference between Conventional Artificial Intelligence to Computational Intelligence. 2. Understand fuzzy logic and reasoning to handle and solve engineering problems 3. Apply the Classification and clustering techniques on various applications. 4. Understand the advanced neural networks and its applications 5. Perform various operations of genetic algorithms, Rough Sets. 6. Comprehend various techniques to build model for various applications UNIT CONTENT No. of Hrs. I Introduction to Soft Computing: Evolutionary Computing, \"Soft\" computing versus \"Hard\" computing, Soft Computing Methods, Recent Trends in Soft Computing, Characteristics of Soft computing, Applications of Soft Computing Techniques. 10 II Fuzzy Systems: Fuzzy Sets, Fuzzy Relations, Fuzzy Logic, Fuzzy Rule-Based Systems, Fuzzy Decision Making, Particle Swarm Optimization. 10 III Genetic Algorithms: Basic Concepts, Basic Operators for Genetic Algorithms, Crossover and Mutation Properties, Genetic Algorithm Cycle, Fitness Function, Applications of Genetic Algorithm. 10 IV Rough Sets, Rough Sets, Rule Induction, and Discernibility Matrix, Integration of Soft Computing Techniques. 9 Text Books: 1. Soft Computing – Advances and Applications - Jan 2015 by B.K. Tripathy and J. Anuradha – Cengage Learning Reference Books: 1. S. N. Sivanandam & S. N. Deepa, “Principles of Soft Computing”, 2nd edition,",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 98
  },
  {
    "chunk_id": "0153",
    "text": "Wiley India, 2008. 2. David E. Goldberg, “Genetic Algorithms-In Search, optimization and Machine learning”, Pearson Education. 3. J. S. R. Jang, C.T. Sun and E.Mizutani, “Neuro-Fuzzy and Soft Computing”, Pearson Education, 2004. 4. G.J. Klir & B. Yuan, “Fuzzy Sets & Fuzzy Logic”, PHI, 1995. 5. Melanie Mitchell, “An Introduction to Genetic Algorithm”, PHI, 1998. 6. Timothy J. Ross, “Fuzzy Logic with Engineering Applications”, McGraw- Hill International editions, 1995",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 98
  },
  {
    "chunk_id": "0154",
    "text": "98 CSPE-713-F: Generative AI Teaching Scheme Credit Marks Distribution Duration of End Semester Examination L T P Internal Assessment End Semester Examination Total 3 1 0 4 Maximum Marks:40 Maximum Marks:60 100 3 Hours Minimum Marks:16 Minimum Marks:24 40 Instructions to the question paper setter: Question paper offend semester examination will be of 60 marks. The question paper will consist of five sections A, B, C, D and E. Sections A, B, C and D will have 2 questions of12 marks each and section E has short answer type questions consisting ofsixpartsof02 marks each. The candidate will attempt five questions in all ,i.e. one question each from sections A, B, C, D and the compulsory question from section E. In the question paper, the questions available in sections A, B, C and D will be covered from Unit-I, Unit-II, Unit-III and Unit-IV respectively and section-E will cover whole syllabus. Course Objectives:  To provide an understanding of Generative AI concepts and models.  To learn various foundational techniques in generative modeling.  To apply prompt engineering and Lang Chain for building generative applications.  To critically assess ethical considerations in Generative AI use. Unit-I Introduction to Generative AI: Definition and Scope of Generative AI, Applications in Various Domains, Importance and Impact of Generative AI, Ethical Considerations and Challenges .Language Models in AI: Introduction to Language Models and Their Role in AI, Traditional Approaches to Language Modeling, N-gram Models, Statistical Methods, and Comparison with Deep Learning Approaches. Unit-II Neural Architectures for Language Modeling: Deep Learning Approaches to Language Modeling, RNNs , LSTMs , Limitations of Sequential Models.Transformers and Generative Pre-trained Transformers (GPT): Introduction to Transformer Architecture, GPT and Its Significance, Pre- training and Fine-tuning in GPT, GPT Variants. Unit-III Lang Chain Framework: Introduction to Lang Chain and Its Objectives, Core Components",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 99
  },
  {
    "chunk_id": "0155",
    "text": "(Chains, Tools, Agents, Memory), Use of Lang Chain in LLM Applications.Prompt Engineering: Concept of Prompt Engineering, Zero-shot, Few-shot and Chain-of-thought Prompts, Best Practices and Design Strategies. Unit-IV Responsible AI and Fairness: Ethical Implications of Generative Models, Bias and Fairness, Responsible Use and Deployment.Applications and Emerging Trends: Use Cases in NLP, Content Creation, Creative Applications, Future Trends.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 99
  },
  {
    "chunk_id": "0156",
    "text": "99 Course Outcomes  Understand the foundational principles, scope, and ethical considerations of Generative AI and language modeling.  Analyze and compare different neural architectures such as RNNs, LSTMs, and Transformers used in large language models (LLMs).  Apply knowledge of GPT models and Lang Chain framework to design domain-specific generative AI solutions.  Evaluate the responsible use of generative AI, including prompt engineering techniques, ethical deployment, and emerging applications. Text Books/ Reference books: 1. Generative Deep Learning by David Foster, 2nd Edition, O'Reilly. 2. Neural Network Methods for Natural Language Processing by Goldberg, Morgan & Claypool Publishers",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 100
  },
  {
    "chunk_id": "0157",
    "text": "100 Honors/Minor Curriculum",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 101
  },
  {
    "chunk_id": "0158",
    "text": "101 Honors Degree in “Data Science” for CSE Department Course Structure S. No. Title L T P Credits 1 Introduction to AI and ML 3 1 0 4 2 Introduction to Data Science 3 1 0 4 3 Computational Data analytics 3 0 0 3 4 Web Data Mining 3 1 0 4 5 Analysing, Visualizing and Applying 3 0 0 3 data science with python TOTAL 15 3 0 18 Minor Degree in “Data Science” for other department Course Structure S. No. Title L T P Credits 1 Introduction to AI and ML 3 0 0 3 2 Introduction to Data Science 3 0 0 3 3 Computational Data analytics 3 1 0 4 4 Web Data Mining 3 1 0 4 5 Analysing, Visualizing and Applying 3 1 0 4 data science with python TOTAL 15 3 0 18",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 102
  },
  {
    "chunk_id": "0159",
    "text": "102 Course Code : DSHD-511/ DSMD-511 Course Title : Introduction to AI & Machine Learning Number of Credits : 4 (L: 3; T: 1; P: 0) Course Category : HD (Honors)/MD (Minor) Course Objective: To review and strengthen important mathematical concepts required for AI & ML. Introduce the concept of learning patterns from data and develop a strong theoretical foundation for understanding state of the art Machine Learning algorithms. Course Contents: Unit-I Defining Artificial Intelligence, Defining AI techniques, Using Predicate Logic and Representing Knowledge as Rules, Representing simple facts in logic, Computable functions and predicates, Procedural vs Declarative knowledge, Logic Programming, Mathematical foundations: Matrix Theory and Statistics for Machine Learning. Unit-II Idea of Machines learning from data, Classification of problem –Regression and Classification, Supervised and Unsupervised learning. Unit-III Linear Regression: Model representation for single variable, Single variable Cost Function, Gradient Decent for Linear Regression, Gradient Decent in practice. Unit-IV Logistic Regression: Classification, Hypothesis Representation, Decision Boundary, Cost function, Advanced Optimization, Multi-classification (One vs All), Problem of Overfitting. Discussion on clustering algorithms and use-cases cantered around clustering and classification. Text Books/References:  Saroj Kaushik, Artificial Intelligence, Cengage Learning, 1st Edition 2011.  Anindita Das Bhattacharjee, “Practical Workbook Artificial Intelligence and Soft  Computing for beginners, Shroff Publisher-X team Publisher.  Yuxi (Hayden) Liu, “Python Machine Learning by Example”, Packet Publishing  Limited, 2017.  Tom Mitchell, Machine Learning, McGraw Hill, 2017.  Christopher M. Bishop, Pattern Recognition and Machine Learning, Springer, 2011.  T. Hastie, R. Tibshirani, J. Friedman. The Elements of Statistical Learning, 2e, 2011.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 103
  },
  {
    "chunk_id": "0160",
    "text": "103 Corresponding Online Resources:  Artificial Intelligence, https://swayam.gov.in/nd2_cec20_cs10/preview. Course Outcomes: After completion of course, students would be able to:  Design and implement machine learning solutions to classification, regression and clustering problems.  Evaluate and interpret the results of the different ML techniques.  Design and implement various machine learning algorithms in a range of Real- world applications.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 104
  },
  {
    "chunk_id": "0161",
    "text": "104 Course Code : DSHD-512/ DSMD-512 Course Title : Introduction to Data Science Number of Credits : 4 (L: 3; T: 1; P: 0) Course Category : HD (Honors)/MD (Minor) Course Objective:  Provide you with the knowledge and expertise to become a proficient data scientist  Demonstrate an understanding of statistics and machine learning concepts that are vital for data science;  Produce Python code to statistically analyse a dataset;  Critically evaluate data visualisations based on their design and use for communicating stories from data; Course Contents: Unit-I Introduction to Data Science, Different Sectors using Data science, Purpose and Components of Python in Data Science. Data Analytics Process, Knowledge Check, Exploratory Data Analysis (EDA), EDA- Quantitative technique, EDA- Graphical Technique, Data Analytics Conclusion and Predictions. Unit-II Feature Generation and Feature Selection (Extracting Meaning from Data)- Motivating application: user (customer) retention- Feature Generation (brainstorming, role of domain expertise, and place for imagination)- Feature Selection algorithms. Unit-III Data Visualization- Basic principles, ideas and tools for data visualization, Examples of inspiring (industry) projects- Exercise: create your own visualization of a complex dataset. Unit-IV Applications of Data Science, Data Science and Ethical Issues- Discussions on privacy, security, ethics- A look back at Data Science- Next-generation data scientists. Text Books/References:  Joel Grus, Data Science from Scratch, Shroff Publisher Publisher /O’Reilly Publisher Media  Annalyn Ng, Kenneth Soo, Numsense! Data Science for the Layman, Shroff Publisher Publisher  Cathy O’Neil and Rachel Schutt. Doing Data Science, Straight Talk from The Frontline. O’Reilly Publisher Media.  Jure Leskovek, Anand Rajaraman and Jeffrey Ullman. Mining of Massive Datasets. v2.1, Cambridge University Press.  Jake VanderPlas, Python Data Science Handbook, Shroff Publisher Publisher /O’Reilly Publisher Media",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 105
  },
  {
    "chunk_id": "0162",
    "text": "105  Philipp Janert, Data Analysis with Open Source Tools, Shroff Publisher Publisher /O’Reilly Publisher Media. Course Outcomes: After completion of course, students would be able to:  Explain how data is collected, managed and stored for data science;  Understand the key concepts in data science, including their real-world applications and the toolkit used by data scientists;  Implement data collection and management scripts using MongoDB.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 106
  },
  {
    "chunk_id": "0163",
    "text": "106 Course Code : DSHD-611/ DSMD-611 Course Title : Computational Data Analytics Number of Credits : 3 (L: 3; T: 0; P: 0) Course Category : HD (Honors)/MD (Minor) Course Objective:  To learn how to think about your study system and research question of interest in a systematic way in order to design an efficient sampling and experimental research program.  To understand how to analyze collected data to derive the most information possible about your research questions. Course Contents: Unit-I Introduction to R Computing language. Best practices in executing Reproducible Research in data science, Sampling and Simulation. Descriptive statistics, and the creation of good observational sampling designs. Unit-II Data visualization, Data import and visualization, Introduction to various plots, Frequentist Hypothesis Testing, Z-Tests, Power Analysis Unit-III Linear regression, diagnostics, visualization, Likelihoodist Inference, Fitting a line with Likelihood, Model Selection with one predictor Unit-IV Bayesian Inference, Fitting a line with Bayesian techniques, Multiple Regression and Interaction Effects, Information Theoretic Approaches Text Books/References:  Practical Data Science with R, Nina Zumel, John Wiley & Sons.  N. C. Das, Experimental Designs in Data Science with Least Resources, Shroff Publisher Publisher.  Hadley Wickham, Garret Grolemund, R for Data Science, Shroff Publisher/O’Reilly Publisher Publisher  Benjamin M. Bolker. Ecological Models and Data in R. Princeton University Press, 2008. ISBN 978-0-691-12522-0.  John Fox and Sanford Weisberg. An R Companion to Applied Regression. Sage Publications, Thousand Oaks, CA, USA, second edition, 2011. ISBN 978-1-4129- 7514-8. Course Outcomes: After completion of course, students would be able to:  Explain how data is collected, managed and stored for data science.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 107
  },
  {
    "chunk_id": "0164",
    "text": "107  Select which type of Machine learning model to be used.  Implement various ML algorithms on data models.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 108
  },
  {
    "chunk_id": "0165",
    "text": "108 Course Code : DSHD-612/ DSMD-612 Course Title : Web Data Mining Number of Credits : 4 (L: 3; T: 1; P: 0) Course Category : HD (Honors)/MD (Minor) Course Objective:  To learn how to extract data from the Web.  To understand how to analyze collected data to derive the most information Course Contents: Unit-I Introduction to internet and WWW, Data Mining Foundations, Association Rules and Sequential Patterns, Basic Concepts of Association Rules, Apriori Algorithm, Frequent Itemset Generation, Association Rule Generation, Data Formats for Association Rule Mining, Mining with multiple minimum supports, Extended Model, Mining Algorithm, Rule Generation. Mining Class Association Rules, Basic Concepts of Sequential Patterns, Mining Sequential Patterns on GSP, Mining Sequential Patterns on Prefix Span, Generating Rules from Sequential Patterns Unit-II Concepts of Information Retrieval, IR Methods, Boolean Model, Vector Space Model and Statistical Language Model, Relevance Feedback, Evaluation Measures, Text and Web Page Pre-processing, Stopword Removal, Stemming, Web Page Preprocessing, Duplicate Detection, Inverted Index and Its Compression, Inverted Index, Search using Inverted Index, Index Construction, Index Compression, Latent Semantic Indexing, Singular Value Decomposition, Query and Retrieval, Web Search, Meta Search, Web Spamming Unit-III Link Analysis, Social Network Analysis, Co-Citation and Bibliographic Coupling, Page Rank Algorithm, HITS Algorithm, CommModuley Discovery, Problem Definition, Bipartite Core CommModuleies, Maximum Flow CommModuleies, Email CommModuleies, Web Crawling, A Basic Crawler Algorithm – Breadth First Crawlers, Preferential Crawlers, Implementation Issues – Fetching, Parsing, Stopword Removal, Link Extraction, Spider Traps, Page Repository, Universal Crawlers, Focused Crawlers, Topical Crawlers, Crawler Ethics and Conflicts. Unit-IV Opinion Mining, Sentiment Classification, Classification based on Sentiment Phrases, Classification Using Text Classification Methods, Feature based Opinion Mining and Summarization, Problem Definition, Object feature extraction, Comparative Sentence and Relation Mining, Opinion Search and Opinion Spam. Web Usage Mining, Data Collection and Preprocessing, Sources and Types of Data, Key Elements",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 109
  },
  {
    "chunk_id": "0166",
    "text": "of Web Usage Data Preprocessing, Data Modeling for Web Usage Mining, Discovery and Analysis of Web Usage Patterns, Session and Visitor Analysis, Cluster Analysis and Visitor Segmentation, Association and Correlation Analysis, Analysis of Sequential and Navigation Patterns.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 109
  },
  {
    "chunk_id": "0167",
    "text": "109 Text Books/References:  Mining the Web: Discovering Knowledge from Hypertext Data, Soumen Chakrabarti, Morgan Kaufmann Publishers.  Bing Liu, Web Data Mining: Exploring Hyperlinks, Contents, and Usage Data, Springer Publications, 2011.  Jiawei Han, Micheline Kamber, Data Mining: Concepts and Techniques, Second Edition, Elsevier Publications 2010.  Anthony Scime, Web Mining: Applications and Techniques, 2005.  Kowalski, Gerald, Mark T Maybury: Information Retrieval Systems: Theory and Implementation, Kluwer Academic Press, 1997.  Mathew Russell, Mining the Social Web 2nd Edition, Shroff Publisher/O’Reilly Publisher Publication.  Data Mining and Data Warehousing Principles and Practical Techniques, Parteek Bhatia, Cambridge University Press. Course Outcomes: After completion of course, students would be able:  To explain how data is can be collected from the Web.  To extract data and information from the webpages.  To make decision based on the data collected.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 110
  },
  {
    "chunk_id": "0168",
    "text": "110 Course Code : DSHD-711/ DSMD-711 Course Title : Analysing, Visualizing and Applying data science with python Number of Credits : 3 (L: 3; T: 0; P: 0) Course Category : HD (Honors)/MD (Minor) Course Objective:  To learn how to use python for data science.  To understand and use all the tools and libraries of python for data science. Course Contents: Unit-I Data Analysis libraries: will learn to use Pandas Data Frames, Numpy multi-dimentional arrays, and SciPy libraries to work with a various dataset. Unit-II Pandas, an open-source library, and how to use it in loading, manipulating, analyzing, and visualizing various datasets. Unit-III Scikit-learn, and machine learning algorithms to build smart models and make predictions, various parameters that can be used to compare various parameters. Unit-IV Descriptive Statistics, Basic of Grouping, ANOVA, Correlation, Polynomial Regression and Pipelines, R-squared and MSE for In-Sample Evaluation, Prediction and Decision Making. Grid Search, Model Refinement, Binning, Indicator variables Text Books/References:  Data Visualization with Python and JavaScript, Kyran Dale, Shroff Publisher/O’Reilly Publisher Publication.  Data Science Using Python and R by Chantal D. Larose and Daniel T. Larose, Wiley Publication.  Python for Data Science and Visualization -Beginners to Pro, Udemy. Course Outcomes: After completion of course, students would:  To explain how data is can be collected from the Web.  To extract data and information from the webpages.  To make decision based on the data collected.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 111
  },
  {
    "chunk_id": "0169",
    "text": "111 Honors Degree in “Artificial Intelligence and Machine Learning” for CSE Department Course Structure S. No. Title L T P Credits 1 Introduction to AI & ML 3 1 0 4 2 Introduction to Data Science 3 1 0 4 3 Special topics in Artificial Intelligence 3 0 0 3 4 Deep Learning and Neural Network 3 1 0 4 5 Applications of AI 3 0 0 3 TOTAL 15 3 0 18 Minor Degree in “Artificial Intelligence and Machine Learning” for other department Course Structure S. No. Title L T P Credits 1 Introduction to AI & ML 3 1 0 4 2 Introduction to Data Science 3 1 0 4 3 Special topics in Artificial Intelligence 3 1 0 4 4 Deep Learning and Neural Network 3 0 0 3 5 Applications of AI 3 0 0 3 TOTAL 15 3 0 18",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 112
  },
  {
    "chunk_id": "0170",
    "text": "112 Course Code : MLHD-511/ MLMD-511 Course Title : Introduction to AI & Machine Learning Number of Credits : 4 (L: 3; T: 1; P: 0) Course Category : HD(Honors)/MD (Minor) Course Objective:  To review and strengthen important mathematical concepts required for AI & ML.  Introduce the concept of learning patterns from data and develop a strong theoretical foundation for understanding state of the art Machine Learning algorithms. Course Contents: Unit-I Defining Artificial Intelligence, Defining AI techniques, Using Predicate Logic and Representing Knowledge as Rules, Representing simple facts in logic, Computable functions and predicates, Procedural vs Declarative knowledge, Logic Programming, Mathematical foundations: Matrix Theory and Statistics for Machine Learning. Unit-II Idea of Machines learning from data, Classification of problem –Regression and Classification, Supervised and Unsupervised learning. Unit-III Linear Regression: Model representation for single variable, Single variable Cost Function, Gradient Decent for Linear Regression, Gradient Decent in practice. Unit-IV Logistic Regression: Classification, Hypothesis Representation, Decision Boundary, Cost function, Advanced Optimization, Multi-classification (One vs All), Problem of Overfitting. Discussion on clustering algorithms and use-cases cantered around clustering and classification. Text Books/References:  Saroj Kaushik, Artificial Intelligence, Cengage Learning, 1st Edition 2011.  Anindita Das Bhattacharjee, “Practical Workbook Artificial Intelligence and Soft  Computing for beginners, Shroff Publisher-X team Publisher.  Yuxi (Hayden) Liu, “Python Machine Learning by Example”, Packet Publishing  Limited, 2017.  Tom Mitchell, Machine Learning, McGraw Hill, 2017.  Christopher M. Bishop, Pattern Recognition and Machine Learning, Springer, 2011.  T. Hastie, R. Tibshirani, J. Friedman. The Elements of Statistical Learning, 2e, 2011.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 113
  },
  {
    "chunk_id": "0171",
    "text": "113 Corresponding Online Resources:  Artificial Intelligence, https://swayam.gov.in/nd2_cec20_cs10/preview. Course Outcomes: After completion of course, students would be able to:  Design and implement machine learning solutions to classification, regression and clustering problems.  Evaluate and interpret the results of the different ML techniques.  Design and implement various machine learning algorithms in a range of Real- world applications.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 114
  },
  {
    "chunk_id": "0172",
    "text": "114 Course Code : MLHD-512/ MLMD-512 Course Title : Introduction to Data Science Number of Credits : 4 (L: 3; T: 1; P: 0) Course Category : HD (Honors)/MD (Minor) Course Objective:  Provide you with the knowledge and expertise to become a proficient data scientist  Demonstrate an understanding of statistics and machine learning concepts that are vital for data science;  Produce Python code to statistically analyse a dataset;  Critically evaluate data visualisations based on their design and use for communicating stories from data; Course Contents: Unit-I Introduction to Data Science, Different Sectors using Data science, Purpose and Components of Python in Data Science. Data Analytics Process, Knowledge Check, Exploratory Data Analysis (EDA), EDA- Quantitative technique, EDA- Graphical Technique, Data Analytics Conclusion and Predictions. Unit-II Feature Generation and Feature Selection (Extracting Meaning from Data)- Motivating application: user (customer) retention- Feature Generation (brainstorming, role of domain expertise, and place for imagination)- Feature Selection algorithms. Unit-III Data Visualization- Basic principles, ideas and tools for data visualization, Examples of inspiring (industry) projects- Exercise: create your own visualization of a complex dataset. Unit-IV Applications of Data Science, Data Science and Ethical Issues- Discussions on privacy, security, ethics- A look back at Data Science- Next-generation data scientists. Text Books/References:  Joel Grus, Data Science from Scratch, Shroff Publisher Publisher /O’Reilly Publisher Media  Annalyn Ng, Kenneth Soo, Numsense! Data Science for the Layman, Shroff Publisher Publisher  Cathy O’Neil and Rachel Schutt. Doing Data Science, Straight Talk from The Frontline. O’Reilly Publisher Media.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 115
  },
  {
    "chunk_id": "0173",
    "text": "115  Jure Leskovek, Anand Rajaraman and Jeffrey Ullman. Mining of Massive Datasets. v2.1, Cambridge University Press.  Jake VanderPlas, Python Data Science Handbook, Shroff Publisher Publisher /O’Reilly Publisher Media  Philipp Janert, Data Analys with Open Source Tools, Shroff Publisher Publisher /O’Reilly Publisher Media. Course Outcomes: After completion of course, students would be able to:  Explain how data is collected, managed and stored for data science;  Understand the key concepts in data science, including their real-world applications and the toolkit used by data scientists;  Implement data collection and management scripts using MongoDB.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 116
  },
  {
    "chunk_id": "0174",
    "text": "116 Course Code : MLHD-612/ MLMD-612 Course Title : Special topics in Artificial Intelligence Number of Credits : 3 (L: 3; T: 0; P: 0) Course Category : HD (Honors)/ MD (Minor) Course Objective: To give fundamental knowledge to the students so that they can understand what the AI is and study important topics related to the field. Course Contents: Unit-I Bayesian Filtering; Recurrent Neural Networks, Deep Neural Networks, Deep Reinforcement Learning. Unit-II Self-Play Networks, Generative Adversarial Networks, Learning from Concept-Drifting Data Streams. Unit-III Audio Signal Processing Basics, mirtoolbox contains many useful audio processing library functions, VOICEBOX: Speech Processing Toolbox for MATLAB, Audio processing in Matlab. Unit-IV Architectures for second generation knowledge-based systems, Distributed AI and its applications. An introduction to neurocomputing and its possible role in AI, The role of uncertainty measures and principles in AI. Text Books/References:  Dr. Nilakshi Jain, Artificial Intelligence: Making a System Intelligent, John Wiley & Sons.  Artificial Intelligence & Soft Computing for Beginners, 3rd Edition-2018, by Anindita Das, Shroff Publisher Publisher.  Artificial Intelligence: A Modern Approach, 3rd Edition, by Stuart Russell and Peter Norvig, Pearson Publisher.  New Artificial Intelligence (Advanced), Takashi Maeda and Fumio Aoki, Ohmsha Publisher.  Course Outcomes: After completion of course, students would be able:  Understand and apply advanced machine learning techniques.  Analyze and implement self-learning AI systems.  Demonstrate proficiency in audio signal processing technique  Understand knowledge-based system and neurocomputing and its role",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 117
  },
  {
    "chunk_id": "0175",
    "text": "117 Course Code : MLHD-611/ MLMD-611 Course Title : Deep Learning and Neural Network Number of Credits : 4 (L: 3; T: 1; P: 0) Course Category : HD (Honors)/ MD (Minor) Course Objective:  To strengthen important Mathematical concepts required for Deep learning and neural network.  To get a detailed insight of advanced algorithms of ML. Course Contents: Unit-I Neural Network: Basics of Machine Learning and AI, Biological Neural Networks vs Artificial Neural Networks, Perceptron, Multi-Layer Perceptron (MLP), Activation Functions: Sigmoid, Tanh, ReLU, Leaky ReLU, Softmax, Loss Functions: MSE, Cross-Entropy, etc., Backpropagation and Gradient Descent Unit-II Deep learning: Introduction to deep learning, Deep Neural Networks (DNNs): Architecture and Concepts, Vanishing and Exploding Gradient Problem, Optimization Techniques: SGD, Adam, RMSProp, Batch Normalization, Dropout, Regularization Unit-III Convolutional Neural Networks (CNNs):Need for CNNs and Architecture, Convolution Operation, Filters/Kernels, Stride, Padding, Pooling: Max and Average Pooling CNN Layers: Convolution, Pooling, Fully Connected, Popular CNN Architectures: LeNet, AlexNet, VGGNet, ResNet, Applications of CNNs: Image Classification, Object Detection Unit-IV Recurrent Neural Networks (RNNs) and Sequence Models: Introduction to Sequential Data, Recurrent Neural Networks: Architecture and Operation, Limitations of Vanilla RNNs, Long Short- Term Memory (LSTM) and Gated Recurrent Unit (GRU), Bidirectional RNNs, Applications of RNNs Text Books/References:  John Paul Mueller, Luca Massaron, Deep Learning for Dummies, John Wiley & Sons.  Adam Gibson, Josh Patterson, Deep Learning, A Practitioner’s Approach, Shroff Publisher /O’Reilly Publisher Media.  Christopher M. Bishop, Neural Networks for Pattern Recognition, Oxford.  Russell Reed, Robert J MarksII, Neural Smithing: Supervised Learning in Feedforward Artificial Neural Networks, Bradford Book Publishers. Course Outcomes: After completion of course, students would be able:  To design and implement Artificial Neural networks.  To decide when to use which type of NN.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 118
  },
  {
    "chunk_id": "0176",
    "text": "118 Course Code : MLHD-711/ MLMD-711 Course Title : Applications of AI Number of Credits : 3 (L: 3; T: 0; P: 0) Course Category : HD (Honors)/ MD (Minor) Course Objective: To give deep knowledge of AI and how AI can be applied in various fields to make the life easy. Course Contents: Unit-I Linguistic aspects of natural language processing, A.I. And Quantum Computing, Applications of Artificial Intelligence (AI) in business. Unit-II Emotion Recognition using human face and body language, AI based system to predict the diseases early, Smart Investment analysis, AI in Sales and Customer Support. Unit-III Robotic Processes Automation for supply chain management. AI-Optimized Hardware, Digital Twin i.e. AI Modelling, Information Technology & Security using AI. Unit-IV Recent Topics in AI/ML: AI/ML in Smart solutions, AI/ML in Social Problems handling, Block chain and AI. Text Books/References:  Sameer Dhanrajani, AI and Analytics, Accelerating Business Decisions, John Wiley & Sons.  Life 3.0: Being Human in the Age of Artificial Intelligence by Max Tegmark, published July 2018.  Homo Deus: A Brief History of Tomorrow by Yuval Noah Harari, published March 2017.  Artificial Intelligence in Practice: How 50 Successful Companies Used AI and Machine Learning to Solve Problems, Bernard Marr, Matt Ward, Wiley. Course Outcomes: After completion of course, students would:  To correlate the AI and solutions to modern problem.  To understand different AI applications  To decide when to use which type of AI technique.",
    "source": "CSE Syllabus 18-07-2025.pdf",
    "page": 119
  }
]